#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_bike.AB_bike_C
// 0xE8FD (0xEFAD - 0x06B0)
class UAB_bike_C : public UBendVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x06B0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_70AB59874FE0F69445C365B498486418;// 0x06B8(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7C21E1F41829930E8C7A8906544B2E9;// 0x07A8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6803BCFB4960E8E3E2AF4EBE091583E0;// 0x0830(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0F9CDD1548983AAE65D38691AB4024A5;// 0x08B8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5DDD51C64627E0F8C37E26BBEE0B71DD;// 0x0928(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5FB6896A4CE3DA71565E4283F181B1EF;// 0x09B0(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5105C14AB7E907C02ECDB35704D2795;// 0x0A20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73069F7648B55656C21EAEA867BE73BD5;// 0x0AB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C65FF7E84112B7FFE3C16DB7295E6DF15;// 0x0B40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE3FCB344AA440022D39781B0E7F6905;// 0x0BD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F5;// 0x0C60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A5;// 0x0CF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C15;// 0x0D80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8D6B1694154C6BE4676DF82F3B513875;// 0x0E10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B2CD6045DBD708CF5BDC94AD58FB9C5;// 0x0EA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80E8798740C84C6265CE12954E17ACB75;// 0x0F30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246C9B5B48AC6E7E3CB3BC96D73644C05;// 0x0FC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A468C6CE4013C7CA636041BDF187FFCC5;// 0x1050(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C523017420B9648E50A298D3BDCEDE75;// 0x10E0(0x0090)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_A40FD70F4F7F37961149A1A6DE4D170D3;   // 0x1170(0x01A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_022181A445DDD5B1D7C050A366C46FE1;// 0x1310(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C99751684593A1A89B034ABD1093CE425;// 0x1378(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF85F4024A2FA05115C474B93150093D5;// 0x13C0(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF49F7C544A02E73877E9CB4A6B4919B3;// 0x1450(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E18A0D34529E26B7994CEBAB8125AB35;// 0x14D8(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_056992084E02367A2D46FDA2F750BE704;   // 0x1520(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C190F2B54E9413880105A1B5A79111314;// 0x16C0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C2CD2C4A3E8773D2074BBC1A4FDF9C5;// 0x1748(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_CA7685F94D2BC85C71BA9D98B40C8453;    // 0x1790(0x01A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_0D0A5382416D22D6990A9485E68AF2AB;// 0x1930(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BD51CC846B5FB2775D9AA900D91F87B5;// 0x1998(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5F1644143BD9FAE32F31FBD8788A4FA4;// 0x19E0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B17D252B490CE3E2EE5A5BBCEE00F8A74;// 0x1AD0(0x0088)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1B58(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_31AF78FE4BAB2B59CD8581A5263377F24;   // 0x1B60(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B957FBB0431C831A4B5C1884751179B14;// 0x1D00(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08AA1A1B46F3D3C54C820CA4664FA20A5;// 0x1D88(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_51FED3F840AFD30166C179B219AF5C82;// 0x1DD0(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_461DF5504943A9D4E374ED9F09C63A24;// 0x1E38(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A048A52E443E49F57AA2CE95E653FB38;// 0x1EA8(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0006F04D4B5E6BED0AA060A2A2F0D2C0;// 0x1F10(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_02E8A5B54BEBC3671C1D5E9B5138FDDE3;// 0x1F80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20E1681040B85A9197BC5F84AF104B093;// 0x1FF0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20B0E890429B3877C20A82B3FDBA622E2;// 0x2078(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_72BFF817478D950C4FAE89BF8668F4372;// 0x2100(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE9DDB54469AC323A437129310868E045;// 0x2170(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930C45354434B3049CB7D281BB599E505;// 0x21D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_56D849A6430F97D667A1ACA20F50F18D;// 0x2220(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_216B711F4248BCD29412728098CD39AE;// 0x2330(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4FE4498D4C1ACBB21088D28B46C3E2DB;// 0x23A0(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FB52237340C3E471C58A16B2D7AE7669;// 0x2428(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B6D266C249A28B72566671AABCB1DED1;// 0x2498(0x0068)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5105C14AB7E907C02ECDB35704D2794;// 0x2500(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73069F7648B55656C21EAEA867BE73BD4;// 0x2590(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C65FF7E84112B7FFE3C16DB7295E6DF14;// 0x2620(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE3FCB344AA440022D39781B0E7F6904;// 0x26B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F4;// 0x2740(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A4;// 0x27D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C14;// 0x2860(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8D6B1694154C6BE4676DF82F3B513874;// 0x28F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B2CD6045DBD708CF5BDC94AD58FB9C4;// 0x2980(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80E8798740C84C6265CE12954E17ACB74;// 0x2A10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246C9B5B48AC6E7E3CB3BC96D73644C04;// 0x2AA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A468C6CE4013C7CA636041BDF187FFCC4;// 0x2B30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C523017420B9648E50A298D3BDCEDE74;// 0x2BC0(0x0090)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_A40FD70F4F7F37961149A1A6DE4D170D2;   // 0x2C50(0x01A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_41C301FB44794706367773BE8194426B;// 0x2DF0(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C99751684593A1A89B034ABD1093CE424;// 0x2E58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF85F4024A2FA05115C474B93150093D4;// 0x2EA0(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF49F7C544A02E73877E9CB4A6B4919B2;// 0x2F30(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E18A0D34529E26B7994CEBAB8125AB34;// 0x2FB8(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_056992084E02367A2D46FDA2F750BE703;   // 0x3000(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C190F2B54E9413880105A1B5A79111313;// 0x31A0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C2CD2C4A3E8773D2074BBC1A4FDF9C4;// 0x3228(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_449120F4436CD5E6393C30B48D0615F5;// 0x3270(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BD51CC846B5FB2775D9AA900D91F87B4;// 0x32D8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5F1644143BD9FAE32F31FBD8788A4FA3;// 0x3320(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B17D252B490CE3E2EE5A5BBCEE00F8A73;// 0x3410(0x0088)
	unsigned char                                      UnknownData01[0x8];                                       // 0x3498(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_31AF78FE4BAB2B59CD8581A5263377F23;   // 0x34A0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B957FBB0431C831A4B5C1884751179B13;// 0x3640(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08AA1A1B46F3D3C54C820CA4664FA20A4;// 0x36C8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_78E06CCC4047DD435E7591A7B82C4B3D;// 0x3710(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2863C7B042D81F351C9A53933C15CDCD;// 0x3778(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A7F8C2D24CFF6F09C46EAF922960AE58;// 0x37E8(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4EEEF5804213260531CAAFBFA2428663;// 0x3850(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_02E8A5B54BEBC3671C1D5E9B5138FDDE2;// 0x38C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20E1681040B85A9197BC5F84AF104B092;// 0x3930(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20B0E890429B3877C20A82B3FDBA622E;// 0x39B8(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_72BFF817478D950C4FAE89BF8668F437;// 0x3A40(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE9DDB54469AC323A437129310868E044;// 0x3AB0(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930C45354434B3049CB7D281BB599E504;// 0x3B18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1993F7F54F239AD56E50EAA005BD3C4E;// 0x3B60(0x0110)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9F0921AD470295A94E3BC6AC95AF4EAE;// 0x3C70(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B614451F4B5B69C1DF2AEF815288785B;      // 0x3CD8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E1BA736340188480F0DC12854395C613;// 0x3D38(0x00F0)
	unsigned char                                      UnknownData02[0x8];                                       // 0x3E28(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B461CA3E42850CA091ECAC95754E6D8D;// 0x3E30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5105C14AB7E907C02ECDB35704D2793;// 0x3EC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73069F7648B55656C21EAEA867BE73BD3;// 0x3F50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C65FF7E84112B7FFE3C16DB7295E6DF13;// 0x3FE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE3FCB344AA440022D39781B0E7F6903;// 0x4070(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F3;// 0x4100(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A3;// 0x4190(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C4DB73D4B628E1769D9EC9209D2C5D9;// 0x4220(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C13;// 0x42B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2169CF55441409B29AFC52A0C5AF87F2;// 0x4340(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8D6B1694154C6BE4676DF82F3B513873;// 0x43D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52FEC05447BCDFD815D5D5A46AB2CB74;// 0x4460(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B28F45FD464F77FD0FE169A29EF8CA64;// 0x44F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B2CD6045DBD708CF5BDC94AD58FB9C3;// 0x4580(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80E8798740C84C6265CE12954E17ACB73;// 0x4610(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246C9B5B48AC6E7E3CB3BC96D73644C03;// 0x46A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A468C6CE4013C7CA636041BDF187FFCC3;// 0x4730(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02633D0841FBC5B1F4C041BCC7C942DF2;// 0x47C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C523017420B9648E50A298D3BDCEDE73;// 0x4850(0x0090)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A60A8EC847D9C75311BE86A670A3434E;// 0x48E0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3FE3D8E248F4E988D5B4639D691B5457;// 0x4980(0x00F0)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_1240DD28483CE71BD84170993F15A998;// 0x4A70(0x0058)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_486B87FF4E9BD7DB74562FAF406C5EB23;// 0x4AC8(0x0068)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_DD3DD73F4E94C3A9954EA18A8ADE4DD3;// 0x4B30(0x0068)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_340A110C49A34F1DAE2F4A91C079C85D;// 0x4B98(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C99751684593A1A89B034ABD1093CE423;// 0x4C00(0x0048)
	unsigned char                                      UnknownData03[0x8];                                       // 0x4C48(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF85F4024A2FA05115C474B93150093D3;// 0x4C50(0x0090)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_970B73724717E9290187FC8F0B3F214B;// 0x4CE0(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1C5F5691431BC4710E4C7F95216E9247;// 0x4D48(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D6F74AE246C13058E4E77E8FF0942F35;// 0x4DB8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4CEA9B454CBFE0191F58F3922064A0FD;// 0x4E40(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0E7F048D454875AB6BA38B9592594C81;// 0x4EC8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62B3E6224ACBE30A494DEE867153C7A7;// 0x4F50(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_675F319A4B5996536A818CA16B9AE463;// 0x4FD8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5A682B20496A515D8E0168B924FDF05A;// 0x50C8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7374B08544B362EF00FDCC987E3DE5A7;// 0x51B8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6CE5A7C84343D71DDCDBEDA986B8B0CF;// 0x52A8(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41CDC53A41DDB20A92A3D69A1BBA6BDE;// 0x5398(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23DEC9AD476845AB872C9D83F781B060;// 0x5420(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_106873F242384FF856738AA86C44A2A9;// 0x54A8(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C4D239CD4FBB0D9035F315B700F11E36;// 0x5530(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B081124142A801FAE7A6548F0273CE24;// 0x5620(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5036D5B143A9DA794696C698CF491FCA;// 0x5710(0x00F0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_990D10614DD6DBC67765749D1E2C68FF;    // 0x5800(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0627772A4038EE0BADCE96A97211C214;// 0x59A0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E18A0D34529E26B7994CEBAB8125AB33;// 0x5A28(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_76FEBA3F46B92325B8FDEA88D1CE94DD;// 0x5A70(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0A501BA542F94A686C25AAA599E45E1C;// 0x5AD8(0x0070)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_F9A932734CAB42254D94179CE53BFAAC;// 0x5B48(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_431CBF84433B69652958FFB31C34D845;// 0x5BA0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B4AEF6E4004340942CE26ACDD0138FC;// 0x5C28(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7D7D07443398435B4040BA72083CAA0;// 0x5CB0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D0BD6DAC4A0A0628EAEEF993AB2E1587;// 0x5D38(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76EA4E104D55B4E4A29AEC8BFBB784B2;// 0x5DC0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BEF2581A43A07E339E21CAB482495A40;// 0x5EB0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_ABD48B6647216AA5CEC29D88269C3F75;// 0x5FA0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A168BE234F25794D2973C89EA69195CA;// 0x6090(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20CA9FB5497EA054C5242E9ABAAA7DAC;// 0x6180(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C1DD0A6B4193175011A80EBF9D98D70E;// 0x6208(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CE6C436425B454312827DBDB1B90C96;// 0x6290(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A266CB7A468FB2436C1F6FBE23001A42;// 0x6318(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2B7DF42B43A7AD9B8A3B3A9B0C7D17C5;// 0x6408(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_17EB87DE4EB04B062727C388ADE52998;// 0x64F8(0x00F0)
	unsigned char                                      UnknownData04[0x8];                                       // 0x65E8(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_6A11F7A248CF6B9AD02B70BA56F9798F;    // 0x65F0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D342F91040ECF9821573C7A7D3F4E0E6;// 0x6790(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C2CD2C4A3E8773D2074BBC1A4FDF9C3;// 0x6818(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C86A08024DB4EEF4D51DB6B11A67C3EA;// 0x6860(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B6960E024CF6E3B9039BFCAC2EF06784;// 0x6900(0x00F0)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_B2D97BE14A8893C424AE9994804B2017;// 0x69F0(0x0058)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_82C895AB48914B01CA2447A07EAE936C2;// 0x6A48(0x0068)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1398DBDE418296BAA3435ABD8388EF51;// 0x6AB0(0x0068)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E49FD8184D01A3EBE1AA2BB7A315FD4C;// 0x6B18(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BD51CC846B5FB2775D9AA900D91F87B3;// 0x6B80(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A9285A94483BCC394A3FA29BF51965EA;// 0x6BC8(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_40C14C85479D2B7A88F1AAA69F0A0C2A;// 0x6C30(0x0070)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_3A5EC8FF4CBBAE8E20E026918B3C57C0;    // 0x6CA0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21C171F94AC5711DB65175A0722C2991;// 0x6E40(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_785F3258482F55AFB57179806DDE7B00;// 0x6EC8(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_469A251740DECB10879EAD967718EBF0;// 0x6FB8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_542607B64219D9E2D40D0CA07D831A93;// 0x7040(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_774ADD3249321FA03A73429E170FD077;// 0x70C8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C73E57344283D0583C22CAB8EB4076D5;// 0x7150(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EBE3BB4C48A930E74B91E9B82AF865CE;// 0x71D8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A78DAEEB41C07D9E394D1DAB403D673E;// 0x72C8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D9C760A84705B2EA0658FEA6F87DA718;// 0x73B8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_859AC7BD4BE274E38BCB50BADCE6C4A0;// 0x74A8(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_095C62254A2E3F7DCB86F0987ED4FF49;// 0x7598(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_97645A744A40C7AA0371BD94E5CD7C03;// 0x7620(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_286DEBF04C756FE219CBEB8B0D6CC6BA;// 0x76A8(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A307D7BC454FAC94AD15D7935C2937A6;// 0x7798(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_586A349F4F8D9A88773C408988196BE0;// 0x7888(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D99268AA48A0CCD4D49FC69DD6DE65DA;// 0x7978(0x0088)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_EA41AAFA4874CFBEFEC584AC5A55C8E2;    // 0x7A00(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8E40B8DC4D7129E91D324CAA681DBCDF;// 0x7BA0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08AA1A1B46F3D3C54C820CA4664FA20A3;// 0x7C28(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE9DDB54469AC323A437129310868E043;// 0x7C70(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930C45354434B3049CB7D281BB599E503;// 0x7CD8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_871995A94387724780D032BEE55C4F5A;// 0x7D20(0x0110)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A287167459F8B3A81B39598C0D69823;// 0x7E30(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B6C5BC0D4FE32B8D0525F3B82B0ED02A;// 0x7EB8(0x0088)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5105C14AB7E907C02ECDB35704D2792;// 0x7F40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73069F7648B55656C21EAEA867BE73BD2;// 0x7FD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C65FF7E84112B7FFE3C16DB7295E6DF12;// 0x8060(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE3FCB344AA440022D39781B0E7F6902;// 0x80F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F2;// 0x8180(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A2;// 0x8210(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C12;// 0x82A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8D6B1694154C6BE4676DF82F3B513872;// 0x8330(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B2CD6045DBD708CF5BDC94AD58FB9C2;// 0x83C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80E8798740C84C6265CE12954E17ACB72;// 0x8450(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246C9B5B48AC6E7E3CB3BC96D73644C02;// 0x84E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A468C6CE4013C7CA636041BDF187FFCC2;// 0x8570(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C523017420B9648E50A298D3BDCEDE72;// 0x8600(0x0090)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_A40FD70F4F7F37961149A1A6DE4D170D;    // 0x8690(0x01A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_486B87FF4E9BD7DB74562FAF406C5EB22;// 0x8830(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C99751684593A1A89B034ABD1093CE422;// 0x8898(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF85F4024A2FA05115C474B93150093D2;// 0x88E0(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF49F7C544A02E73877E9CB4A6B4919B;// 0x8970(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E18A0D34529E26B7994CEBAB8125AB32;// 0x89F8(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_056992084E02367A2D46FDA2F750BE702;   // 0x8A40(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C190F2B54E9413880105A1B5A79111312;// 0x8BE0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C2CD2C4A3E8773D2074BBC1A4FDF9C2;// 0x8C68(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_82C895AB48914B01CA2447A07EAE936C;// 0x8CB0(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BD51CC846B5FB2775D9AA900D91F87B2;// 0x8D18(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5F1644143BD9FAE32F31FBD8788A4FA2;// 0x8D60(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B17D252B490CE3E2EE5A5BBCEE00F8A72;// 0x8E50(0x0088)
	unsigned char                                      UnknownData05[0x8];                                       // 0x8ED8(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_31AF78FE4BAB2B59CD8581A5263377F22;   // 0x8EE0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B957FBB0431C831A4B5C1884751179B12;// 0x9080(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08AA1A1B46F3D3C54C820CA4664FA20A2;// 0x9108(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_41CF86844230C29F056B1BA2553E8DCA;// 0x9150(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0082BAB9433C4CCA53B373BED32D9CBD;// 0x91B8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20E1681040B85A9197BC5F84AF104B09;// 0x9228(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_02E8A5B54BEBC3671C1D5E9B5138FDDE;// 0x92B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_99CE421A44613C34CE0681B3F02F21FB;// 0x9320(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5ADDC221401EA49344A244805AC1ABE5;// 0x93A8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE9DDB54469AC323A437129310868E042;// 0x9418(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930C45354434B3049CB7D281BB599E502;// 0x9480(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E2C798774B09F1E5C63D4BA2B1F8114C;// 0x94C8(0x0110)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_224114FB499E954F4D85FF91816047A1;// 0x95D8(0x0088)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3AE8BC084EB1EB9BF43485843CC4E896;// 0x9660(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E8E17B434929DEEE0B7C92AA5072A9ED;// 0x96D0(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6FE007A64E08408F68F5328070E175CE;// 0x9738(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_34F686EB48BEA758526214B8984FAA9A;// 0x97A8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_D418F78E4C31CCDC2635599842A54640;// 0x9818(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0D9778742BC605F33DDA2B537511AA3;// 0x9880(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7C4F349448935091C489218B08970B6E;// 0x98C8(0x0110)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FA38DD684DBA5E5EB036AB9651EAD4B0;// 0x99D8(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4814AE1840591DB0F0C9E09B0B3A1F72;// 0x9A40(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9825F69741EB69D95CCD3C9406B3D44B;// 0x9A88(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8CD841D545D54E94BE8264B4E67E12CB;// 0x9B98(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1183637E4C25E726D1E6CC8DCC67AF04;// 0x9C08(0x0100)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0EDD5F7A48BA9CD11E8756A7341C04B5;// 0x9D08(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_23BC1C8E48F7252A199C3CB19BCE4A87;// 0x9D50(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2441F0844A3E4F6597AFAD940DD16066;// 0x9E48(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2920C9A74A17F0AFB251F1B121DE8D0B;// 0x9E90(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_92487B6E4CEF9A9FC8C7DB8393C72BF7;// 0x9ED8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3088DFAE407D0036E9E672901BDF71E7;// 0x9F78(0x00A0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_FE5EDE9949BAAAFDDC1FC2B44424902B;// 0xA018(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48D921DB4C6A0591C6D1A28986B8554F;// 0xA050(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5105C14AB7E907C02ECDB35704D279;// 0xA0E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73069F7648B55656C21EAEA867BE73BD;// 0xA170(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C65FF7E84112B7FFE3C16DB7295E6DF1;// 0xA200(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE3FCB344AA440022D39781B0E7F690;// 0xA290(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F;// 0xA320(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A;// 0xA3B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C26FAAB846445E7D71D2E0BB0662A417;// 0xA440(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C1;// 0xA4D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E900A4C442C1E8172623689D8C9B7B6;// 0xA560(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8D6B1694154C6BE4676DF82F3B51387;// 0xA5F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5203FF0C47BD2FC0425AD28D60922D0F;// 0xA680(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F913D0694D3DFD2F4B2549AA97B9F241;// 0xA710(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D41A32A04138C4199058E390FB881619;// 0xA7A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B2CD6045DBD708CF5BDC94AD58FB9C;// 0xA830(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80E8798740C84C6265CE12954E17ACB7;// 0xA8C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246C9B5B48AC6E7E3CB3BC96D73644C0;// 0xA950(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A468C6CE4013C7CA636041BDF187FFCC;// 0xA9E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02633D0841FBC5B1F4C041BCC7C942DF;// 0xAA70(0x0090)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_AA1255604AAD7C1545E5DFB11E9AB760;    // 0xAB00(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_20AE99D44B41083470EEB59F22140C8B;    // 0xACA0(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_05DFB01F4ADA0682579503BD4A6F4173;// 0xAE40(0x0048)
	unsigned char                                      UnknownData06[0x8];                                       // 0xAE88(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C523017420B9648E50A298D3BDCEDE7;// 0xAE90(0x0090)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5A4F73804C345ABB65B8079E66CE876C;// 0xAF20(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B160DEA64DDC6D262B46B3A2DB3FBBEC;// 0xAF88(0x00F0)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_A9B7C99343BC87E58A6A5382343F410B;// 0xB078(0x0058)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_486B87FF4E9BD7DB74562FAF406C5EB2;// 0xB0D0(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_BAF27CE3483B87BBA4E0FF941DC35DE0;// 0xB138(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_48F33F05413CD1A0A0CC6283043ADBF6;// 0xB1D8(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C99751684593A1A89B034ABD1093CE42;// 0xB240(0x0048)
	unsigned char                                      UnknownData07[0x8];                                       // 0xB288(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF85F4024A2FA05115C474B93150093D;// 0xB290(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04DC781D404D7E5BA47190A7786C251E;// 0xB320(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9C3FB469434F0B1CEEA5F5AA0A988081;// 0xB3A8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A82147444DD2AE068062999F66A80AED;// 0xB430(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_81A3CCE646EB8DE48121E18F5E3F33AA;// 0xB4B8(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_18CB84904FF790D94FF4AEB37B498BC5;// 0xB540(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BF2F3B6846CB107832E034B475F7E0E3;// 0xB630(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_24234BD0479C8764F05BD0967EFD554B;// 0xB720(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0BFF5CBF4D57BE3E40AFFF85F0BC1BE9;// 0xB810(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9965F90146945581639900B09C481C32;// 0xB900(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9CF21DDA4CABCFABC859DB90E46F044B;// 0xB988(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F6CD21D4CE11E99CB07268912B5EE57;// 0xBA10(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F12AE67343BEB2E67D3D639BEA27E2E1;// 0xBA98(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5C19882E4AE8B55F064B43A420407680;// 0xBB88(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_669263A74D7D8853C4D86C95A9B9A388;// 0xBC78(0x00F0)
	unsigned char                                      UnknownData08[0x8];                                       // 0xBD68(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_139A13F44E4B33C782FFCBAE92ABDC22;    // 0xBD70(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D59455204857824C91BB50B19F2AF1E0;// 0xBF10(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E18A0D34529E26B7994CEBAB8125AB3;// 0xBF98(0x0048)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_2ACCF0144AEC59118B16618EF482603D;// 0xBFE0(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E94BDCA540883BB29DCFAC8668779533;// 0xC038(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F7FF3DC44CAEF0ECB349981A780CAA3;// 0xC0C0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E014B4E488658F7E5B42CBB261CD297;// 0xC148(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_096FC16D46523FABCEEB36B56578E030;// 0xC1D0(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_58B3A02444C4541A02F0A98ECA15B367;// 0xC258(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_34EC31CE4A46C7243A8056817CC58162;// 0xC348(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_027693F04BA344A0AF34768D12953F07;// 0xC438(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4EDE321440510ECEBD406EAE51B30600;// 0xC528(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B2FEC2549A589C3F98BA2A7B6C559EF;// 0xC618(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6044CD644347D94040939B95FCD6A383;// 0xC6A0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2966A93F4D9510B8E8AB8189BD6FB63C;// 0xC728(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8699C15F4685F038621DA7A47FF9BCEA;// 0xC7B0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BD4FBC41425F5DFC70C8C182F3AE041C;// 0xC8A0(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_805A3165417A54ED384EA2839D10DFD2;// 0xC990(0x00F0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_056992084E02367A2D46FDA2F750BE70;    // 0xCA80(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C190F2B54E9413880105A1B5A7911131;// 0xCC20(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C2CD2C4A3E8773D2074BBC1A4FDF9C;// 0xCCA8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9E859CDD436FE75A1AB79AAE28084014;// 0xCCF0(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FF6FB96642018CE7DF40688A11BB44D2;// 0xCD58(0x00F0)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_9F6C2446471ADABDA47F5FB02B3BDE56;// 0xCE48(0x0058)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_44F623ED4345B7016EB6C1B286F5BF3E;// 0xCEA0(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_20AF057444DC7A8B0B109FB11E1D5E7B;// 0xCF40(0x0068)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_18CBB3044391A963BED6DDBCA360CA92;// 0xCFA8(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BD51CC846B5FB2775D9AA900D91F87B;// 0xD010(0x0048)
	unsigned char                                      UnknownData09[0x8];                                       // 0xD058(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_154CC8C64B5CB662FD244AA0FEC723C6;    // 0xD060(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_63F261C24B0B348FF247C6B830D4EAE4;// 0xD200(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3D3AFE5B4F690067FDC491B4CEC50E92;// 0xD288(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C77DB0004F9F85BF67335FBDDB349A81;// 0xD378(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_93967AA843A01FF4D1B414BC10C657DF;// 0xD400(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DAD3E40F40E8EB641255198265D483BF;// 0xD488(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF598818406D2D603DEB6095E5A027DB;// 0xD510(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_38B633F747CD13E7608EB8962F57DA63;// 0xD598(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F3DCBD2B454801B89DCC039465AE18DF;// 0xD688(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2E8A07CF41AB76E873DEFDA4BDBB5BB6;// 0xD778(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A042BAB34541856B9ADF3DBEC31F259F;// 0xD868(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4FA732040D48B90DD9F1AA40385538B;// 0xD958(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6EF47C7A4BD4AC3E76C9E689CA6AAA0D;// 0xD9E0(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CDFEBC284149232500A42AAF074F09AC;// 0xDA68(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4A112E9B4D7B6EA276FDFAAC0DE5A916;// 0xDB58(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5F1644143BD9FAE32F31FBD8788A4FA;// 0xDC48(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B17D252B490CE3E2EE5A5BBCEE00F8A7;// 0xDD38(0x0088)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_31AF78FE4BAB2B59CD8581A5263377F2;    // 0xDDC0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B957FBB0431C831A4B5C1884751179B1;// 0xDF60(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08AA1A1B46F3D3C54C820CA4664FA20A;// 0xDFE8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE9DDB54469AC323A437129310868E04;// 0xE030(0x0068)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930C45354434B3049CB7D281BB599E50;// 0xE098(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_38C43C784BB4CD9023A3DD9DEFD24355;// 0xE0E0(0x0110)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_949E42D34A944E7CE4B1E7B7AE2E6B8C;// 0xE1F0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4CE892874E56D87B50DA67857B62CE92;// 0xE238(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AD212FB7423F1852A42103B2C9B7B204;// 0xE2E0(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5092F30C47CEDF0609E96DA9795BA02A;// 0xE388(0x00A8)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_859709724E533E6B557170AD4CE16C06;// 0xE430(0x0218)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B8C9C27D426B255EF8D213A8EF238C65;// 0xE648(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B875E56F4358EA9998679496D1DEBA6A;// 0xE6F0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5BA341FA478E8A5848AD51B935939198;      // 0xE738(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_Root_108987FF4C7CD446DC8FF3A78B561660;      // 0xE798(0x0048)
	struct FBendAnimNode_BlockGraphTillSetupValid      BendAnimGraphNode_BlockGraphTillSetupValid_8BAC5FD14A6AADE06C6BC2B8C3A5782D;// 0xE7E0(0x0050)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_67FA8242466898185A5DE2BB4CA28AB0;// 0xE830(0x0058)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BA6A131A406B2B742EA4249212485266;// 0xE888(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7DA71E0B467B73DAA4F50E8A5C14048A;// 0xE980(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D2FB709A46D87B0A828BCAA7B974A6A3;// 0xE9C8(0x0048)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_D00F885D406C2EFBB44AE8908A472890;// 0xEA10(0x0070)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_80760EB047D7898E1E148096D7D4DBE0;// 0xEA80(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E7BE6DBB4A039145F09395ADF68D1F22;// 0xEAC8(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8C13376C4093C5EC9BD2B9A320592F1E;// 0xEBB8(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4E563B054E4DE4ED5B78EC82BB0DD398;// 0xEC60(0x00F8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_41DE813A435428C3DA0FE2AE339B948D;// 0xED58(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6163C3724FA94FBC1F4155898B20D03B;// 0xEDF8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_249DF1D6467F69AF9EDAFBAD76AB874A;// 0xEE40(0x0068)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_041AD9F4435DB20CAC907299A2522096;// 0xEEA8(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_56A9807549FAAC6175D2A9B86000E7AA;// 0xEEE0(0x00A0)
	struct FVector                                     BackWheelOffset;                                          // 0xEF80(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    BackWheelRotation;                                        // 0xEF8C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAB_bike_size>                         BikeSize;                                                 // 0xEF98(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               hasHadRider;                                              // 0xEF99(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0xEF9A(0x0002) MISSED OFFSET
	float                                              xOut;                                                     // 0xEF9C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              bike_damage_max;                                          // 0xEFA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               isFrontWheel;                                             // 0xEFA4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0xEFA5(0x0003) MISSED OFFSET
	float                                              NewVar_2;                                                 // 0xEFA8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               VehicleExitLeftSide;                                      // 0xEFAC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass AB_bike.AB_bike_C");
		return ptr;
	}


	void WhatBikeIsThis(TEnumAsByte<EAB_bike_size>* VehBIkeType);
	void UpdateVehicleHasDriverHasPassengers();
	void UpdateSeatBounce(float DeltaTime);
	void UpdateEnterExitLeftSide();
	void UpdatePhysicsWeight();
	void UpdateLean();
	void UpdateWheel(int WheelIndex, bool FrontWheel_, struct FVector* Offset, struct FRotator* Rotator);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_bike_AnimGraphNode_TransitionResult_B30B78D144BFAF6A8B00DF8B4BAA1B0F_4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_bike_AnimGraphNode_TransitionResult_C31BCB5545BDEC4BF63CD1B91E2E0E8A_4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_bike_AnimGraphNode_TransitionResult_953CDDED47FC947AF219BBA595DF69C1_4();
