#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass BLDG_wigwam_hotel_b1_Nest_Proxy.BLDG_wigwam_hotel_b1_Nest_Proxy_C
// 0x0130 (0x0478 - 0x0348)
class ABLDG_wigwam_hotel_b1_Nest_Proxy_C : public ABendCoverProxy
{
public:
	class UBendCoverProxyComponent*                    BendCoverProxy26;                                         // 0x0348(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy24;                                         // 0x0350(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy23;                                         // 0x0358(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy22;                                         // 0x0360(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy21;                                         // 0x0368(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy20;                                         // 0x0370(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy19;                                         // 0x0378(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy18;                                         // 0x0380(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy17;                                         // 0x0388(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy16;                                         // 0x0390(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy15;                                         // 0x0398(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy14;                                         // 0x03A0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy13;                                         // 0x03A8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy12;                                         // 0x03B0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy11;                                         // 0x03B8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy10;                                         // 0x03C0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy50;                                         // 0x03C8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy49;                                         // 0x03D0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy48;                                         // 0x03D8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy47;                                         // 0x03E0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy46;                                         // 0x03E8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy45;                                         // 0x03F0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy41;                                         // 0x03F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy40;                                         // 0x0400(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy39;                                         // 0x0408(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy38;                                         // 0x0410(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy37;                                         // 0x0418(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy36;                                         // 0x0420(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy9;                                          // 0x0428(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy8;                                          // 0x0430(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy7;                                          // 0x0438(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy6;                                          // 0x0440(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy5;                                          // 0x0448(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy4;                                          // 0x0450(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy3;                                          // 0x0458(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy2;                                          // 0x0460(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy1;                                          // 0x0468(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBendCoverProxyComponent*                    BendCoverProxy;                                           // 0x0470(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BlueprintGeneratedClass BLDG_wigwam_hotel_b1_Nest_Proxy.BLDG_wigwam_hotel_b1_Nest_Proxy_C");
		return ptr;
	}


	void UserConstructionScript();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
