#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class BendGame.ActionIcon
// 0x0090 (0x02D8 - 0x0248)
class UActionIcon : public UUserWidget
{
public:
	TEnumAsByte<EInputType>                            ActionType;                                               // 0x0248(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EBendInputPrimaryType>                 DesiredBinding;                                           // 0x0249(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x024A(0x0006) MISSED OFFSET
	struct FName                                       ActionName;                                               // 0x0250(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowHoldIndication;                                      // 0x0258(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EConsoleForGamepadLabels>              ForcedInputDevice;                                        // 0x0259(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bHideForKeyboardAndMouse;                                 // 0x025A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x025B(0x0001) MISSED OFFSET
	int                                                DesiredIconSize;                                          // 0x025C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                KeyboardIconColor;                                        // 0x0260(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                KeyboardIconBackgroundColor;                              // 0x0270(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBackgroundForKeyboardAndMouse;                       // 0x0280(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBackgroundForGamepad;                                // 0x0281(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0282(0x0002) MISSED OFFSET
	float                                              HoldProgress;                                             // 0x0284(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UDataTable*                                  KeyTextureDataTable;                                      // 0x0288(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnColor;                                                  // 0x0290(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnVisualUpdate;                                           // 0x02A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x28];                                      // 0x02B0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.ActionIcon");
		return ptr;
	}


	void SetShowHoldIndication(bool bShow);
	void SetHoldProgress(float InProgress);
	void SetForcedInputDevice(TEnumAsByte<EConsoleForGamepadLabels> InForcedInputDevice);
	void SetActionType(TEnumAsByte<EInputType> InActionType);
	void SetActionName(const struct FName& InActionName);
	void OnHoldProgressChanged(float InProgress);
	bool HasValidVisuals();
	bool HasValidBinding();
	void HandleOnInputBindingChange(const struct FName& InputName);
};


// Class BendGame.ActionTextBlock
// 0x0058 (0x02A0 - 0x0248)
class UActionTextBlock : public UUserWidget
{
public:
	struct FText                                       Text;                                                     // 0x0248(0x0018) (Edit, DisableEditOnTemplate)
	struct FLinearColor                                DefaultActionColor;                                       // 0x0260(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                DefaultBackgroundColor;                                   // 0x0270(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EConsoleForGamepadLabels>              ForcedInputDevice;                                        // 0x0280(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0281(0x0007) MISSED OFFSET
	class UDataTable*                                  KeyTextureDataTable;                                      // 0x0288(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0290(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.ActionTextBlock");
		return ptr;
	}


	void SetText(const struct FText& InText);
	void SetForcedInputDevice(TEnumAsByte<EConsoleForGamepadLabels> InForcedInputDevice);
	struct FText GetText();
};


// Class BendGame.BendVehicleRamManager
// 0x0018 (0x0040 - 0x0028)
class UBendVehicleRamManager : public UObject
{
public:
	float                                              LockoutTimeBetweenInitalImpacts;                          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDebugEnabled;                                            // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x13];                                      // 0x002D(0x0013) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendVehicleRamManager");
		return ptr;
	}

};


// Class BendGame.VehicleAwarenessManager
// 0x0010 (0x0038 - 0x0028)
class UVehicleAwarenessManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.VehicleAwarenessManager");
		return ptr;
	}

};


// Class BendGame.AIVehicleManager
// 0x0068 (0x03B0 - 0x0348)
class AAIVehicleManager : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0348(0x0008) MISSED OFFSET
	TArray<struct FCornerInfo>                         mCornerMaxVelocityTable;                                  // 0x0350(0x0010) (Edit, ZeroConstructor)
	class UBendRoadEdgeProvider*                       RoadEdgeProvider;                                         // 0x0360(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              LockTimeAfterAvoid;                                       // 0x0368(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeltaTimeToPredict;                                       // 0x036C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ArtificialRadiusExpansion;                                // 0x0370(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBlindfireDebug;                                          // 0x0374(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0375(0x0003) MISSED OFFSET
	class UBendVehicleRamManager*                      VehicleRammingManager;                                    // 0x0378(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UVehicleAwarenessManager*                    VehicleAwarenessManager;                                  // 0x0380(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0388(0x0008) MISSED OFFSET
	TArray<class UBendMotorcycleRiderGroup*>           m_motorcycleGroups;                                       // 0x0390(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData03[0x10];                                      // 0x03A0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.AIVehicleManager");
		return ptr;
	}


	void RemoveAllGroups();
	class UBendVehicleRamManager* GetRamManager();
	class UBendMotorcycleRiderGroup* GetGroup(const struct FString& GroupName);
	class UVehicleAwarenessManager* GetAwarenessManager();
	class AAIVehicleManager* STATIC_GetAIVehicleManager();
	void EnableRVODebug(bool enable);
	void EnableDebugDraw();
	void EnableCornerDebugDraw();
	void DisableDebugDraw();
	void DisableCornerDebugDraw();
	void DebugDrawToggle();
	class UBendMotorcycleRiderGroup* CreateGroup(const struct FString& GroupName, const struct FGroupFormationSettings& formationSettings);
	void CleanupDriver(class ABendPawn* driver);
	void AddGroup(class UBendMotorcycleRiderGroup* motoGroup);
};


// Class BendGame.AIVehicleWaypoint
// 0x0028 (0x0370 - 0x0348)
class AAIVehicleWaypoint : public AActor
{
public:
	struct FScriptMulticastDelegate                    OnStoppedAtVehicleWaypoint;                               // 0x0348(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<TEnumAsByte<EWaypointEnd>>                  mReachedEndTasks;                                         // 0x0358(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0368(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.AIVehicleWaypoint");
		return ptr;
	}


	void OnReachedWaypoint(class AVehiclePawn* VehiclePawn, bool isEndWaypoint);
	void OnReachedEndWaypoint(class AVehiclePawn* VehiclePawn);
};


// Class BendGame.BendTypes
// 0x0000 (0x0028 - 0x0028)
class UBendTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendTypes");
		return ptr;
	}

};


// Class BendGame.CalloutActorInterface
// 0x0000 (0x0028 - 0x0028)
class UCalloutActorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.CalloutActorInterface");
		return ptr;
	}

};


// Class BendGame.BendImpactEffect
// 0x0218 (0x0560 - 0x0348)
class ABendImpactEffect : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleComponent;                                        // 0x0348(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParticleSystemComponent*                    ParticleExitComponent;                                    // 0x0350(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParticleSystemComponent*                    m_pProjParticleSmokeComponent;                            // 0x0358(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0360(0x0008) MISSED OFFSET
	struct FImpactFxData                               DefaultImpactFX;                                          // 0x0368(0x0198) (Edit, DisableEditOnInstance)
	bool                                               UseImpactEffectPool;                                      // 0x0500(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0501(0x0003) MISSED OFFSET
	struct FVector                                     avoidCenter;                                              // 0x0504(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0510(0x000C) MISSED OFFSET
	bool                                               ImpactSndHandledInBlueprint;                              // 0x051C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1B];                                      // 0x051D(0x001B) MISSED OFFSET
	TArray<struct FImpactFxData>                       ImpactFXs;                                                // 0x0538(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x18];                                      // 0x0548(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendImpactEffect");
		return ptr;
	}


	void RemoveAvoidance();
	void OnImpactEffectSpawned(TEnumAsByte<EPhysicalSurface> SurfaceType);
	void OnImpact();
	class AController* GetInstigator();
	class ABendImpactEffect* STATIC_CreateImpactEffectBP(class UClass* ImpactTemplate, const struct FVector& Location, const struct FRotator& Rotation, const struct FVector& SurfaceNormal, const struct FRotator& ParticleRotation, const struct FVector& ShootDir, class AController* InstigatorCtrl, bool DestructionOnly);
	void AddAvoidLocation(const struct FVector& Location, float Radius, float Duration, float FadeOutTime);
};


// Class BendGame.BendRegionWeaponData
// 0x0020 (0x0048 - 0x0028)
class UBendRegionWeaponData : public UDataAsset
{
public:
	class UDataTable*                                  LoadoutDataTable;                                         // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FFactionTierData>                    FactionData;                                              // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TEnumAsByte<EBendWorldTier>                        WorldTier;                                                // 0x0040(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendRegionWeaponData");
		return ptr;
	}

};


// Class BendGame.BendCrowdSpawnListenerInterface
// 0x0000 (0x0028 - 0x0028)
class UBendCrowdSpawnListenerInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendCrowdSpawnListenerInterface");
		return ptr;
	}

};


// Class BendGame.BendVehiclePartsRandomizer
// 0x0018 (0x0360 - 0x0348)
class ABendVehiclePartsRandomizer : public AActor
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0348(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendVehiclePartsRandomizer");
		return ptr;
	}


	void SetVehiclePartsDatabase(class UBendVehiclePartsDatabase* PartsDatabase);
	void SetDefaultPartIndex(TEnumAsByte<EMotorcyclePartType> Type, int Index);
	void RandomizeParts();
	int RandomizeDefaultPartIndex(TEnumAsByte<EMotorcyclePartType> Type);
	class UBendVehiclePartsDatabase* GetVehiclePartsDatabase();
};


// Class BendGame.BendAmbientGenerator
// 0x0F70 (0x12B8 - 0x0348)
class ABendAmbientGenerator : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0348(0x0010) MISSED OFFSET
	bool                                               SouthernRegionOptsActive;                                 // 0x0358(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0359(0x0003) MISSED OFFSET
	float                                              SpeedRequiredToTriggerLowerSpawnsSouthernRegions;         // 0x035C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimeRequiredAtSpeedToLowerSpawnsSouthernRegions;          // 0x0360(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimeRequiredBelowSpeedToRaiseSpawnsSouthernRegions;       // 0x0364(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SouthernRegionMaxSpawnCount;                              // 0x0368(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SouthernRegionMaxSpawnCountWhenFast;                      // 0x036C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HordeCountReducesSpawnCountSouthernRegions;               // 0x0370(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0371(0x0003) MISSED OFFSET
	int                                                HordeCountToReduceSpawnsNormal;                           // 0x0374(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HordeCountToReduceSpawnsSpeed;                            // 0x0378(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxCountReductionForHordeWhenFast;                        // 0x037C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxCountReductionForHordeNormal;                          // 0x0380(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0384(0x0004) MISSED OFFSET
	class UClass*                                      WorldTierConditions[0x5];                                 // 0x0388(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBendConditionsObject*                       WorldTierConditionsInstances[0x5];                        // 0x03B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET
	TArray<struct FBendAmbientSpawnType>               PooledSpawnTypes;                                         // 0x03E0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<TAssetPtr<class UBendArchetypeDataBase>>    AllArchetypes;                                            // 0x03F0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UBendArchetypeDataBase*>              Archetypes;                                               // 0x0400(0x0010) (ZeroConstructor)
	TArray<TEnumAsByte<EInventoryWeaponID>>            PooledWeaponTypes;                                        // 0x0410(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FMeshListArray                              AlternativeMeshLists[0x2C];                               // 0x0420(0x0028) (Edit, DisableEditOnInstance)
	TArray<class UBendSkeletalMeshArrayData*>          PoolReplaceableMeshLists;                                 // 0x0B00(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                             PooledWeapons;                                            // 0x0B10(0x0010) (ZeroConstructor)
	TArray<struct FSpawnPool>                          PooledSpawns;                                             // 0x0B20(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData05[0x40];                                      // 0x0B30(0x0040) MISSED OFFSET
	class UEnvQuery*                                   SpawnLocationQuery;                                       // 0x0B70(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               m_bActive;                                                // 0x0B78(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0B79(0x0003) MISSED OFFSET
	float                                              m_fBaseAmbientSpawnModifier;                              // 0x0B7C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fSpawnMinRadius;                                        // 0x0B80(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fSpawnMaxRadius;                                        // 0x0B84(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fCanDespawnRadius;                                      // 0x0B88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fForceDespawnRadius;                                    // 0x0B8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fTimeBetweenCollections;                                // 0x0B90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fTimeBetweenSpawns;                                     // 0x0B94(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_fTimeBetweenUpdates;                                    // 0x0B98(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x0B9C(0x0004) MISSED OFFSET
	TArray<struct FBendAmbientSpawnType>               CombatEscalationSpawnTypes;                               // 0x0BA0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UBendSkeletalMeshArrayData*>          AlwaysLoadedMeshLists;                                    // 0x0BB0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               m_bDisableUnimportantSpawns;                              // 0x0BC0(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	TEnumAsByte<ESpawnImportance>                      m_SpawnImportanceToBlockBelow;                            // 0x0BC1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x6];                                       // 0x0BC2(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnSpawnedWithVehicle;                                     // 0x0BC8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnVehicleSpawned;                                         // 0x0BD8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSpawned;                                                // 0x0BE8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnKilled;                                                 // 0x0BF8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class ABendCrowdGroupGlobal*                       ScreamCrowdGroup;                                         // 0x0C08(0x0008) (ZeroConstructor, IsPlainOldData)
	class ABendCrowdGroupGlobal*                       DemotedCrowdGroup;                                        // 0x0C10(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               CombatEscalation_OpenArea;                                // 0x0C18(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CombatEscalation_InCover;                                 // 0x0C19(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x6];                                       // 0x0C1A(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnEscalationSpawnedTelemetry;                             // 0x0C20(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData10[0xB0];                                      // 0x0C30(0x00B0) MISSED OFFSET
	TArray<struct FBendSpawnRequestData>               m_QueuedRequests;                                         // 0x0CE0(0x0010) (ZeroConstructor, Transient)
	TArray<TWeakObjectPtr<class ABendAmbientSpawnArea>> m_spawnAreaPopulation;                                    // 0x0CF0(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData11[0x94];                                      // 0x0D00(0x0094) MISSED OFFSET
	int                                                m_iSpawnLimitByImportance[0x7];                           // 0x0D94(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData12[0x90];                                      // 0x0DB0(0x0090) MISSED OFFSET
	TAssetPtr<class UBlueprint>                        DefaultDrop;                                              // 0x0E40(0x0020)
	class UBlueprint*                                  LoadedDefaultDrop;                                        // 0x0E60(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x408];                                     // 0x0E68(0x0408) MISSED OFFSET
	class ABendAIPawn*                                 SpawningPawn;                                             // 0x1270(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x40];                                      // 0x1278(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAmbientGenerator");
		return ptr;
	}


	void UpdateSouthernRegionOverlapOverrides(bool IncrementUp);
	void UpdateCurrentWorldTier();
	void UpdateConditionalLooks();
	bool SpawnForCombatEscalation(const struct FVector& CenterLocation, float Radius);
	void SpawnAllAvilable(float Brightness);
	void SetImportanceToBlockBelow(TEnumAsByte<ESpawnImportance> importance);
	void ScreamerSpawn(const struct FBendAmbientSpawnType& SpawnType, int spawnCount);
	void ReturnSpawnToPool(class ABendAIController* Controller);
	void ResetGlobalSpawnLimit();
	void ResetDemotedCrowdLimit();
	void ResetDeadSpawns();
	void RequestSpawnSimple(const struct FBendAmbientSpawnType& Type, class ABendSpawnLocationBase* Location, const struct FScriptDelegate& OnSpawnedDelegate, int Count, bool deactivateLocation);
	void RequestSpawn(const struct FBendSpawnRequestData& request, int Count, bool deactivateLocation);
	void RemoveAmbientVehicleSpawnBox(class ABendVehiclePawnSpawnLocation* abox);
	void RemoveAmbientSpawnBox(class ABendSpawnLocationBase* abox);
	void RemoveAmbientSpawnArea(class ABendAmbientSpawnArea* aArea);
	void OverrideGlobalSpawnLimitNEW(int newLimit);
	void OverrideGlobalSpawnLimit(int newLimit);
	void OverrideDemotedCrowdLimit(int newLimit);
	void OnScreamerSpawnSpawned(class ABendAIController* SpawnedController, class ABendPawn* SpawnedPawn, class ABendSpawnLocationBase* SpawnLocation);
	void OnRegionChanged(TEnumAsByte<ERegions> Region);
	void OnPlayerTeleported(class ABendPawn* Character);
	void OnPlayerRespawn(class ABendPlayerController* PlayerController);
	void OnMissionEnd(class UBendMissionData* LastMissionData);
	void OnMissionBegin(TEnumAsByte<EMissionIDs> MissionID);
	void OnFinishedSpawnOnVehicleSeat(class ABendAIController* SpawnedController, class ABendPawn* SpawnedPawn, class AVehiclePawn* SpawnedVehiclePawn);
	void OnFastTravelBegin(const struct FName& TravelDestination);
	void OnFadeFromBlackStart(const struct FString& Message);
	void OnEscalationSpawned(class ABendAIController* SpawnedController, class ABendPawn* SpawnedPawn, class ABendSpawnLocationBase* SpawnLocation);
	void OnDemoJumpPoint(class UDataAsset* JobOrMissionID);
	void NotifyVehicleSpawned(class AVehiclePawn* SpawnedVehiclePawn);
	void NotifySpawnedWithVehicle(class ABendSpawnLocationBase* SpawnBox, class ABendAIController* SpawnedController, class ABendPawn* SpawnedPawn, class AVehiclePawn* SpawnedVehiclePawn, bool autoSpawnOnVehicle, const struct FBendAmbientSpawnType& SpawnType);
	void NotifySpawned(class ABendAIController* SpawnedController, class ABendPawn* SpawnedPawn);
	void NotifyKilled(class ABendAIController* KilledController, class ABendPawn* KilledPawn);
	TEnumAsByte<EBendWorldTier> STATIC_GetWorldTierByLocation(const struct FVector& Location);
	TEnumAsByte<EBendWorldTier> GetWorldTier();
	int GetTotalActiveCount();
	int GetSpawnLimit(TEnumAsByte<ESpawnImportance> importance);
	float GetPercentageOfFactionInTrackedSpawns(TEnumAsByte<EAIFactionType> Faction);
	int GetNumSpawnsOfFactionLastHundred(TEnumAsByte<EAIFactionType> Faction);
	int GetGlobalSpawnLimit();
	int GetDemotedCrowdLimit();
	int GetAliveCrowdMembers();
	int GetActiveSpawnCount();
	int GetActiveByAwareness(TEnumAsByte<EAIAwareState> Awareness);
	void ForceDespawnAll(bool resetSpawnedCount, bool resetToKilled, bool Delay);
	void DespawnUnit(class ABendAIController* Controller, bool notifyDespawn, bool runFullDespawn);
	void DespawnUnimportantOutsideRadius(const struct FVector& Location, float Radius, bool immediate, TEnumAsByte<ESpawnImportance> importance);
	void DespawnUnimportantInRadius(const struct FVector& Location, float Radius, bool immediate, TEnumAsByte<ESpawnImportance> importance);
	void DespawnUnimportant(bool immediate, TEnumAsByte<ESpawnImportance> importance);
	void AddAmbientVehicleSpawnBox(class ABendVehiclePawnSpawnLocation* abox);
	void AddAmbientSpawnBox(class ABendSpawnLocationBase* abox);
	void AddAmbientSpawnArea(class ABendAmbientSpawnArea* aArea);
};


// Class BendGame.BendState
// 0x0038 (0x0060 - 0x0028)
class UBendState : public UObject
{
public:
	struct FString                                     m_StateName;                                              // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class AActor*                                      m_Owner;                                                  // 0x0038(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ABendStateMachine*                           m_StateMachine;                                           // 0x0040(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendState");
		return ptr;
	}


	void WhileInState(float DeltaSeconds);
	void ResetStateTimer();
	void RequestStateTimerEvent(float atTime);
	void ReenterState();
	void OnStateTimerEvent();
	void OnPathComplete(TEnumAsByte<EPathFollowingResult> Result);
	void OnInitState();
	void OnExitState();
	void OnEnterState();
	void OnBeginPlay();
	float GetStateTimer();
	void ChangeState(const struct FString& newStateName);
};


// Class BendGame.BendAnimState_Base
// 0x0050 (0x00B0 - 0x0060)
class UBendAnimState_Base : public UBendState
{
public:
	TEnumAsByte<EBendAnimCategory>                     AnimCategory;                                             // 0x0060(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	struct FAnimStateRotationParams                    RotationParams;                                           // 0x0068(0x0040) (Edit, BlueprintVisible)
	class ABendPawn*                                   PawnOwner;                                                // 0x00A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAnimState_Base");
		return ptr;
	}


	bool IsActive();
	TEnumAsByte<EBendAnimState> GetStateEnumeratedType();
	class ABendPawn* GetPawnOwner();
	TEnumAsByte<EBendAnimCategory> GetAnimCategory();
};


// Class BendGame.PerformActionContext
// 0x00E0 (0x0108 - 0x0028)
class UPerformActionContext : public UObject
{
public:
	struct FBendActionData                             ActionData;                                               // 0x0028(0x00A0) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               ActionStarted;                                            // 0x00C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsPlaying;                                                // 0x00C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x00CA(0x0002) MISSED OFFSET
	float                                              Duration;                                                 // 0x00CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentTime;                                              // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EPeformActionFailedReason>             FailedReason;                                             // 0x00D4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x33];                                      // 0x00D5(0x0033) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.PerformActionContext");
		return ptr;
	}


	void UpdateBlendspaceParameters(const struct FName& Slot, float X, float Y, float Z);
	void CancelThisAction(bool bReturnToPreviousState, float BlendOutTime);
};


// Class BendGame.BendAnimState_PerformAction
// 0x01F0 (0x02A0 - 0x00B0)
class UBendAnimState_PerformAction : public UBendAnimState_Base
{
public:
	TArray<class UPerformActionContext*>               ActiveContexts;                                           // 0x00B0(0x0010) (ZeroConstructor, Transient)
	TArray<TWeakObjectPtr<class UPerformActionContext>> CompletedContexts;                                        // 0x00C0(0x0010) (ZeroConstructor, Transient)
	class UPerformActionContext*                       CurrentContext;                                           // 0x00D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00D8(0x0008) MISSED OFFSET
	struct FPerformActionRequest                       CurrentRequest;                                           // 0x00E0(0x0120) (Transient)
	unsigned char                                      UnknownData01[0xA0];                                      // 0x0200(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAnimState_PerformAction");
		return ptr;
	}


	float PerformAction(const struct FBendActionData& TheActionData, class AActor* PropActor, const struct FTransform& AnchorWorldTransform, const struct FScriptDelegate& OnCompleteDelegate, const struct FScriptDelegate& OnFailDelegate, const struct FScriptDelegate& OnLoopDelegate, const struct FName& MasterTimelineName);
	void OnMontageStarted(class UAnimMontage* Montage);
	bool CanGrapple();
	bool CancelActionWithBlendOutTime(float BlendOutTime, bool bForceCleanup);
	bool CancelActionWithActionData(const struct FBendActionData& ActionToCancel, float BlendOutTime);
	bool CancelAction();
	bool CanBeStealthKilled();
	bool CanBePairKilled();
	bool CanBeMeleeAttacked();
	bool CanBeGrappled();
};


// Class BendGame.FactionManager
// 0x00B0 (0x00D8 - 0x0028)
class UFactionManager : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnFactionLevelChanged;                                    // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTrustTierChanged;                                       // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0048(0x0010) MISSED OFFSET
	int                                                TrustRequiredForLow;                                      // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TrustRequiredForMedium;                                   // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TrustRequiredForHigh;                                     // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TrustTotal;                                               // 0x0064(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	TAssetPtr<class UDataTable>                        FactionDataTable;                                         // 0x0068(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	TAssetPtr<class UDataTable>                        ConfidenceDataTable;                                      // 0x0088(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FFactionEntry>                       Factions;                                                 // 0x00A8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame)
	TArray<struct FBaseConfidenceEntry>                BaseConfidences;                                          // 0x00B8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	float                                              VeryLowThreshold;                                         // 0x00C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData)
	float                                              LowThreshold;                                             // 0x00CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData)
	float                                              HighThreshold;                                            // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData)
	float                                              VeryHighThreshold;                                        // 0x00D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.FactionManager");
		return ptr;
	}


	void SetPlayerFaction(TEnumAsByte<EAIFactionType> TheirFaction, float NewValue);
	void SetFactionLevel(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction, TEnumAsByte<EFactionLevel> NewFactionType);
	void SetFaction(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction, float NewValue);
	float PlayerFactionValue(TEnumAsByte<EAIFactionType> TheirFaction);
	class UBendEncampmentData* GetEncampmentDataForFaction(TEnumAsByte<EAIFactionType> Type);
	float GetBaseConfidence(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction);
	TEnumAsByte<EFactionLevel> FactionValueToLevel(float FactionValue);
	float FactionValueBP(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction);
	float FactionLevelToValue(TEnumAsByte<EFactionLevel> FactionLevel);
	TEnumAsByte<EFactionLevel> FactionLevel(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction);
	float AdjustPlayerFaction(TEnumAsByte<EAIFactionType> TheirFaction, float AdjustValue);
	float AdjustFaction(TEnumAsByte<EAIFactionType> MyFaction, TEnumAsByte<EAIFactionType> TheirFaction, float AdjustValue);
};


// Class BendGame.BendAmbientBlockerComp
// 0x0030 (0x0240 - 0x0210)
class UBendAmbientBlockerComp : public USceneComponent
{
public:
	float                                              SphereRadius;                                             // 0x0210(0x0004) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockAmbientEvents;                                      // 0x0214(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bForceUnloadAmbientEvents;                                // 0x0215(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockUnimportantSpawns;                                  // 0x0216(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	TEnumAsByte<ESpawnImportance>                      LowestImportanceToAllow;                                  // 0x0217(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bForceDespawnUnimportant;                                 // 0x0218(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	TArray<TEnumAsByte<EAIFactionType>>                SpecificFactionsToBlock;                                  // 0x0220(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               m_bDebugDrawSphere;                                       // 0x0230(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0231(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAmbientBlockerComp");
		return ptr;
	}


	bool IsOverlapping(const struct FVector& testLocation, float testRadius);
};


// Class BendGame.BendAnimVariationData
// 0x0048 (0x0070 - 0x0028)
class UBendAnimVariationData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	TArray<struct FBendAnimSetCompatibilityRating>     CompatibilityRatings;                                     // 0x0030(0x0010) (Edit, ZeroConstructor, EditConst)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0040(0x0008) MISSED OFFSET
	unsigned char                                      Priority;                                                 // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	TArray<struct FBendAnimSequenceGroup>              AnimSequenceGroup_FlatList;                               // 0x0050(0x0010) (Edit, ZeroConstructor, EditConst)
	TArray<struct FBendAnimBlendSpaceGroup>            AnimBlendSpaceGroup_FlatList;                             // 0x0060(0x0010) (Edit, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAnimVariationData");
		return ptr;
	}


	TArray<struct FBendAnimSequenceEntry> GetSequenceEntryList(const struct FName& AnimSequenceGroupName);
	class UAnimSequenceBase* GetRandomSequence(const struct FName& AnimSequenceGroupName, class USkeleton* CurrentSkeleton, class UAnimSequenceBase* LastUsed);
	class UBlendSpaceBase* GetRandomBlendSpace(const struct FName& AnimBlendSpaceGroupName, class USkeleton* CurrentSkeleton, class UBlendSpaceBase* LastUsed);
	int GetNumSequences(const struct FName& AnimSequenceGroupName, class USkeleton* CurrentSkeleton, bool bForceStrictCompatibilityCheck);
	int GetNumBlendSpaces(const struct FName& AnimBlendSpaceGroupName, class USkeleton* CurrentSkeleton, bool bForceStrictCompatibilityCheck);
	TArray<struct FBendAnimBlendSpaceEntry> GetBlendSpaceEntryList(const struct FName& AnimBlendSpaceGroupName);
	bool ContainsGroup(const struct FName& AnimGroupName);
};


// Class BendGame.StatusEffect
// 0x0040 (0x0068 - 0x0028)
class UStatusEffect : public UObject
{
public:
	TEnumAsByte<EStatusEffects>                        EffectType;                                               // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	float                                              Duration;                                                 // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       EffectOwner;                                              // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AController>                  EffectInstigator;                                         // 0x0038(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class ABendPawn>                    AffectedPawn;                                             // 0x0040(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TickRate;                                                 // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AllowedToFinish;                                          // 0x004C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShouldTransferEffect;                                     // 0x004D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x004E(0x0002) MISSED OFFSET
	class UClass*                                      TransferEffect;                                           // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0058(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.StatusEffect");
		return ptr;
	}


	void SetTickRate(float newTickrate);
	void SetDuration(float newDuration);
	void RestartEffect();
	void OnTick(bool* StopEffect);
	void OnStart();
	void OnRestart();
	void OnEnd();
};


// Class BendGame.BendWeapon_Manager
// 0x0078 (0x0148 - 0x00D0)
class UBendWeapon_Manager : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x00D0(0x0018) MISSED OFFSET
	TArray<TWeakObjectPtr<class ABendEquippableItem>>  EquippedItems;                                            // 0x00E8(0x0010) (ZeroConstructor, Transient)
	TWeakObjectPtr<class ABendWeapon>                  PreviousWeapon;                                           // 0x00F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class ABendWeapon>                  LastProjectileWeapon;                                     // 0x0100(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class ABendWeapon>                  LastMeleeWeapon;                                          // 0x0108(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class ABendWeapon>                  DesiredWeapon;                                            // 0x0110(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class ABendEquippableItem>          EquipingItem;                                             // 0x0118(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class ABendEquippableItem>          HolsteringItem;                                           // 0x0120(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	float                                              WeaponHolsterTimeout_Normal;                              // 0x0130(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WeaponHolsterTimeout_Blindfire;                           // 0x0134(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0138(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendWeapon_Manager");
		return ptr;
	}


	class ABendEquippableItem* GetHolsteringItem();
};


// Class BendGame.BendAIWeapon_Manager
// 0x0040 (0x0188 - 0x0148)
class UBendAIWeapon_Manager : public UBendWeapon_Manager
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0148(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAIWeapon_Manager");
		return ptr;
	}

};


// Class BendGame.BendEquippable_Manager
// 0x0220 (0x02F0 - 0x00D0)
class UBendEquippable_Manager : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    PostAddedWeaponCallback;                                  // 0x00D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x18];                                      // 0x00E0(0x0018) MISSED OFFSET
	TArray<TEnumAsByte<EWeaponSocketLocation>>         WeaponSocketLocationOrder;                                // 0x00F8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FWeaponInitializationList                   DefaultWeaponInitializationData;                          // 0x0108(0x0018) (Edit, DisableEditOnInstance)
	TArray<TWeakObjectPtr<class ABendWeapon>>          DefaultWeapons;                                           // 0x0120(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0xB0];                                      // 0x0130(0x00B0) MISSED OFFSET
	TAssetPtr<class UClass>                            BinocularsBlueprintRef;                                   // 0x01E0(0x0020) (Edit, DisableEditOnInstance)
	class ABendEquippableItem*                         Binoculars;                                               // 0x0200(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInventoryWeaponID>                    RockWeaponID;                                             // 0x0208(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0209(0x0007) MISSED OFFSET
	class ABendWeapon*                                 RockWeapon;                                               // 0x0210(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInventoryWeaponID>                    TrapDetonatorWeaponID;                                    // 0x0218(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	class ABendWeapon*                                 TrapDetonatorWeapon;                                      // 0x0220(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInventoryWeaponID>                    BootKnifeWeaponID;                                        // 0x0228(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0229(0x0007) MISSED OFFSET
	class ABendWeapon*                                 BootKnifeWeapon;                                          // 0x0230(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EInventoryWeaponID>                    TaserWeaponID;                                            // 0x0238(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0239(0x0007) MISSED OFFSET
	class ABendWeapon*                                 TaserWeapon;                                              // 0x0240(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x78];                                      // 0x0248(0x0078) MISSED OFFSET
	struct FName                                       SocketLocationToName[0x6];                                // 0x02C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendEquippable_Manager");
		return ptr;
	}


	class ABendEquippableItem* GetBinoculars();
	void AddEquippableItem(class ABendEquippableItem* Item, TEnumAsByte<EEquippableSlot> EquippableSlot, bool bEquip);
};


// Class BendGame.BendAttackAnimData
// 0x0048 (0x0070 - 0x0028)
class UBendAttackAnimData : public UDataAsset
{
public:
	TArray<struct FBendAttackAnim>                     AttackAnimsList;                                          // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FBendAttackAnim>                     AttackAnimsListTwoHand;                                   // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FBendNamedAttackList>                NamedAttacksList;                                         // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FBendNamedAttackList>                NamedAttacksListTwoHand;                                  // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              ScaleFactor;                                              // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendAttackAnimData");
		return ptr;
	}


	struct FBendAttackData GetNamedAttackAction(const struct FName& Name, class ABendPawn* Attacker, class AActor* Target, const struct FVector& targetVel, class USkeleton* CurrentSkeleton, float aimAngle, bool ignoreDistanceCheck, bool HasRightArm, bool HasLeftArm, bool usingTwoHander);
	struct FBendAttackData GetAttackAction(class ABendPawn* Attacker, class AActor* Target, const struct FVector& targetVel, class USkeleton* CurrentSkeleton, float aimAngle, bool ignoreDistanceCheck, bool HasRightArm, bool HasLeftArm, bool usingTwoHander);
};


// Class BendGame.BendWeaponDamageableInterface
// 0x0000 (0x0028 - 0x0028)
class UBendWeaponDamageableInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendWeaponDamageableInterface");
		return ptr;
	}

};


// Class BendGame.BendArmorData
// 0x0018 (0x0040 - 0x0028)
class UBendArmorData : public UDataAsset
{
public:
	TArray<TEnumAsByte<EeDamageLocations>>             ProtectedBodyParts;                                       // 0x0028(0x0010) (Edit, ZeroConstructor)
	float                                              Health;                                                   // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ForceAmountForArmorShotOff;                               // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendArmorData");
		return ptr;
	}

};


// Class BendGame.BendSkeletalMeshLook
// 0x0000 (0x0070 - 0x0070)
class UBendSkeletalMeshLook : public UBendSkeletalMeshLookBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class BendGame.BendSkeletalMeshLook");
		return ptr;
	}

};


// Class BendGame.BendPawnArmorData
// 0x0018 (0x0058 - 0x0040)
