#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass DeerVim.DeerVim_C
// 0xFD06 (0x10FF6 - 0x12F0)
class UDeerVim_C : public UBendAnimalAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x12F0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_55E68B0C464827C0158CAAB882C4F3C3;// 0x12F8(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7A722B414EA9F202AF4BE09457DA76C7;// 0x13E8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_BA5D70834CAAB386364C0DB62B1E8192;// 0x1430(0x0038)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_62CD8450481CAA406702F1B802121AA4;// 0x1468(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E7EB65D942D5B0BE74EBFA8763026B94;// 0x14B0(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10EEF3214CD203AACACCDA935D010642;// 0x15A8(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_031A40664C5D72595C2E3C96C852AA0D;// 0x16A0(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E2D331F84CC1C5B8CA0876AB352CC941;// 0x1798(0x00F8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC5;// 0x1890(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF5;// 0x1920(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85017;// 0x19B0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344167;// 0x1B20(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_49395DB3492121D31F30CAB8236827335;// 0x1B68(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C53D7B0494A3482A4EACFA1F40220A75;// 0x1BA0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C714FB5C4F2459C47172FCBAAAD435B0;// 0x1BE8(0x0110)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1CF8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC4;// 0x1D00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF4;// 0x1D90(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85016;// 0x1E20(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344166;// 0x1F90(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_49395DB3492121D31F30CAB8236827334;// 0x1FD8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C53D7B0494A3482A4EACFA1F40220A74;// 0x2010(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AF2E758A448B4D457C4C8192AF05B0CA;// 0x2058(0x0110)
	unsigned char                                      UnknownData01[0x8];                                       // 0x2168(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2DD4A3D4E584C1D852D0885CBA20BD9;// 0x2170(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC3;// 0x2200(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF3;// 0x2290(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8693A1E34320104DD66E13920433DD5A;// 0x2320(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85015;// 0x23B0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344165;// 0x2520(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85014;// 0x2568(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344164;// 0x26D8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_49395DB3492121D31F30CAB8236827333;// 0x2720(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C53D7B0494A3482A4EACFA1F40220A73;// 0x2758(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AC7398A349D4353D34E970AD75E528E6;// 0x27A0(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1EC32826477C7D715A4EEB9DF6FEF55D;// 0x28B0(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0F74A0E74F240F4EE5A9BE8753C15EA7;// 0x2920(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C68A1F3F4642B4629AE07EA2E34F5791;// 0x2A18(0x00F8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37002ED24C24AAC0E038DEB311F5421C;// 0x2B10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC2;// 0x2BA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF2;// 0x2C30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_467713AF423D7DEB0FFAB38866E782CE;// 0x2CC0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85013;// 0x2D50(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344163;// 0x2EC0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA85012;// 0x2F08(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A344162;// 0x3078(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_49395DB3492121D31F30CAB8236827332;// 0x30C0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C53D7B0494A3482A4EACFA1F40220A72;// 0x30F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FD9BBBE94C7F5B7DC1D94289C7511DBF;// 0x3140(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FFBE62F9431AA643FA63D3B9DED7269D;// 0x3250(0x00F8)
	unsigned char                                      UnknownData02[0x8];                                       // 0x3348(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC;// 0x3350(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF;// 0x33E0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8CD3428740FC04CFBC7BD1A248BA8501;// 0x3470(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EB7C456D44E88334A5D87F9979A34416;// 0x35E0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_49395DB3492121D31F30CAB823682733;// 0x3628(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C53D7B0494A3482A4EACFA1F40220A7;// 0x3660(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7026CC284C43AE2806BDD685903EC527;// 0x36A8(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_503296FB487DB447FC3A029C106991C8;// 0x37B8(0x00F8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F7E4367740C904E876AA8586AB4022EA;// 0x38B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11EACD604A82A5F815D95299605E4944;// 0x3940(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DE09A6945293ABA38C6278E3F80E944;// 0x39D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D78F58D34EDAEDA61989F4B69E68590F;// 0x3A60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FDD2177A454A8CFC141D39822481D17D;// 0x3AF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9D988A249B290B123B220A330618FBD;// 0x3B80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33CD953E40A0D4424F4B5BB55520C192;// 0x3C10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4D80AAA40802BBA4ABA4199E4F7EB87;// 0x3CA0(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D856E2344004D5582C4991B3571A9820;// 0x3D30(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5007268740885183D9556BA8D3E9B292;// 0x3E20(0x0088)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_234E00E447C280D5AC65B5816161F1F4;// 0x3EA8(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3C50B4394BEC5BC86D66DCB3ABC4169A;// 0x3EE0(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DB5C0F624D3BB861E335349635F4D699;// 0x3FD0(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CD87DAE546271627F95E79ADD4A5A87D2;// 0x4130(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BFAFAFEA4F27D985556B8396A0325A3F;// 0x4178(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2A500554C70D2D358ABD39B61C856DC;// 0x4268(0x0088)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_729DF81F40342055E8C18085E55E15D6;// 0x42F0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D58CC91410C49BE7AA9B19B4157DC87;// 0x4328(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E6AD5502468B4844C16D61BC638AB3B5;// 0x4418(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3C276D1D4B7B65BA0599D2B48E9041AC;// 0x4578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32171A58486FDA884305EC9F060158D6;// 0x45C0(0x0090)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_E3AEFBC042636101AE4BC69BBE7DC81C;// 0x4650(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CD87DAE546271627F95E79ADD4A5A87D;// 0x4688(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5E3491984149186899ABB8910CF600A8;// 0x46D0(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CBEF3F234CAA7295C4385D8591356003;// 0x47E0(0x0070)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_A51F0A88415BC09C1575909E3F8242C9;// 0x4850(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FFAC1B0B49DE8B5BBC29E9951B9E7151;// 0x4888(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_54D635E84FFCD6CEA4E9F486CC870B58;// 0x48D0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_15F0AD8E4C9BF86A8F9A248566B26053;// 0x4908(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_76C55ED645F3A7ED3E390CAD4082F986;// 0x4950(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DD490264482C9D7D096F088DD81E02F9;// 0x4A60(0x0070)
	struct FAnimNode_BendBonesIKBlendspace             AnimGraphNode_BendBonesIKBlendspace_82DAD1434E9867E59E16EBA739B66B2E;// 0x4AD0(0x09B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8CB9AE3040D3C006BB5F428664C07E92;// 0x5480(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D42343B946BA7D871D2A3CA10AD2B4F5;// 0x5510(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D74F40B94DE122EE0A9AE48D6660AEE6;// 0x55A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A45238F447C7DEE7E3709840642FA83;// 0x5630(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B138B3794F8C7BB3ED94EB84B61653EF;// 0x56C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5875DC064ED8844A314DC2B5B07015B3;// 0x5750(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11321BAC450E85BEADCE139665B088C6;// 0x57E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF8ABDA944DF51514CF4AF955F3F8643;// 0x5870(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CF10AA1410AE916DFD0B2B72417E9B9;// 0x5900(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B9250A6C4E309AF465A86EA1848AB835;// 0x5990(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_369B950A409F9F2E0005ACA7ADEED32A;// 0x5A20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34D4AC3E423F29EB536149B26FF15583;// 0x5AB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A20968F475C68A22F65BD929E212586;// 0x5B40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C37ABE47FC5DF9B5458AB60BFB3161;// 0x5BD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_66D7DBEE49C8A1C2ABBB9C839C39FC33;// 0x5C60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A8E0D684698E7E9096B6BA295810BB7;// 0x5CF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F61BA80848D504FB61402F9B5EE319BB;// 0x5D80(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_BB29B3E14789F81866DA8CB34D791829;// 0x5E10(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_758EE3FB4972DA7EB5C3C69EE8D7E1EB;// 0x5F80(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7977256546855C76A533C989673FF0FA;// 0x5FC8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_741D86A44E826F01704C8C8F6AA333CB;// 0x6010(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A052DB924246D6E177EC4DAF7DDAB6E4;// 0x6080(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7559DFFE4804F2B215210DA476B60D0C;// 0x60C8(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_968D8E5C4DF944E3A4626A8DD092F9D0;// 0x6138(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_488BAF4D4BB2C587EF8E2592095AC308;// 0x6180(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_D28EB8CB43B019457C83E4B65812E6D6;// 0x61F0(0x0238)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_38EAC37A4AF4D76330DB158C3799437E;// 0x6428(0x00F0)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_0011256D4CA8BB06B4943FA4052A4C0A;// 0x6518(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20B65E6544AB85E44CB7A7BA4D59C00F;// 0x6750(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9515D19A4649FADB1C8C5B96968C7214;// 0x6798(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_75CDF6524F0BFBF6F15E28A2B17A4A37;// 0x67E0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F967798845926A8C3E2B18BB866D3C2C;// 0x6850(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BA2A6EE04EB4A8BE738C41A3800174F5;// 0x6898(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DDA91686471F82D2A4C9D89AEEEA98AE;// 0x6908(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9AE9FBB2404193087DC46082283FD784;// 0x6950(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_7B79885645040D0F56F68CB103929DB9;// 0x69C0(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C45E1B4D47D388B6D2274F82C2E06488;// 0x6BF8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BD33E60A415A0F2F737E1B8B27E8454A;// 0x6C40(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7A08E0114A73092184F390BC3CB708D8;// 0x6C88(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_42706D09422DAB660B0E9480B98CE752;// 0x6CF8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_273D4A0E43BA54FBBFF47CB85D377AA0;// 0x6D40(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_71F560874EE193D373A385B60DC22B62;// 0x6DB0(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_87AA02634C164D619822BCB6ED98694E;// 0x6FE8(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_FD7E567C4478DD2F4D80D5B43A487D14;// 0x7030(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF2B6315427F6A635FB12EAB7A15C4F9;// 0x7268(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_B625EB8244485582649A448996001E9F;// 0x72B0(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BAB2773745192460AC21CFA4BF16CF22;// 0x74E8(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_CB5780D44F3BF7DA91BE1396CEB33A5C;// 0x7530(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7A7A69243804610B905CA90A9251645;// 0x7768(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED9A60494B7688771666048C22F81EE1;// 0x77B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C69CA3B74CD924F450E6B1BE4FB62C61;// 0x7840(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_0F51E25648EA3955F3C3FAAB6B87D14C;// 0x78D0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_46E7322542925B9B062D41BE1381D803;// 0x7A40(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82EDC6A64424C0F8332A84B2FD96E0A6;// 0x7A88(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A63EBCF4426B41B38AF300846FAF6DC7;// 0x7AD0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_489849574C7CA1E606B164BC6C7EAC09;// 0x7B40(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7A190DBA4DB069E5BE5928A4893EE445;// 0x7B88(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_12DFA39D4D6DFE357B987DA5505F0AEE;// 0x7BF8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C1B48F9D4701C731084439B2E8300FC3;// 0x7C40(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EE0DCB0D49C07E7E6886E1AAE340BF3D;// 0x7CB0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_378880274309460FD87B68A60409DDF3;// 0x7CF8(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_2D5A76854F981FA598626FB30557CF92;// 0x7D68(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BD62A00B4A0685BCEF592AAF8EA8B6F8;// 0x7ED8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38F57F7E4DECF06908B7FF8A3F48A4AA;// 0x7F20(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C3C747F94DEF07EA59D1CB8FE02AC0FE;// 0x7F68(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86DB34BC4F4CF98BA572C9A027261D71;// 0x7FD8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3A291F5F482EDEFC10887E8E3596EF2D;// 0x8020(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DB82DC634AB6BE50E7BA1DB18C988F74;// 0x8090(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_ACE0F077405460CC60D19B9F7342BCBA;// 0x80D8(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_63C4A7C1494D0ACA07A65B800CB9A5BE;// 0x8148(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01CD0D7C4654405000D92894E7518499;// 0x8380(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_176A6133499A2D3B2200A884D19AA972;// 0x83C8(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6A81B5C5491A798297A985B7376D0DBE;// 0x84D8(0x00F8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9FB5132E46B16A4E01DC63845DEF5029;      // 0x85D0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2BF09ABF4B4C90BB0EA361BC6FF49C36;// 0x8630(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A90D553444F602B3D0C9A396FF5400B8;// 0x8720(0x00F0)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_53C224F346A7F7B24480BC8766B39358;// 0x8810(0x0238)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3CA2957544CE29A7801573B9B492FF4C;// 0x8A48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2762836E45F798488166EBA5B46A3619;// 0x8A90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9FC69A8421684ACCB6480BA1FA7EC78;// 0x8B20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6D73BE0403D8C144418E09A5AC1B838;// 0x8BB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B6F64D74AFAF815BCBD16BF41E750EE;// 0x8C40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E9AB9A54A18909E98BC9DBDBB239BC0;// 0x8CD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DB3569948EFBB75701E30888898F028;// 0x8D60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FA7BA8B4783FDBF6692BD95CCAD5637;// 0x8DF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6488B874435534E952D8CE85820376C8;// 0x8E80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4A3CB6443EE7851B430E79F447B6577;// 0x8F10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF79204B4E8C8B3D426D78B4B8A28E53;// 0x8FA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B78F99D048A6DDC579CC038CD7389148;// 0x9030(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF534B394437A1FD2653C09EB2B9D8B1;// 0x90C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_156AABBD482AFAE58B60EF80AADFE8B8;// 0x9150(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97FB411C456ADCEAAFC4EB8C08A61407;// 0x91E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D741588D4BEF51677FE38A9F9866156B;// 0x9270(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5365464947AF80F79A9A36A6D418779C;// 0x9300(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_197A362E4425D3B3531740B074D0E7E8;// 0x9390(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B46CF98A4EB46238FB52619C83109F8D;// 0x9420(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73D52D7E442D909EC2630E975B86E288;// 0x94B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C7142934AF4A6D8FAC7A4873735747B;// 0x9540(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D37801784815CD460A633AB16F64F8D8;// 0x95D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57FB004940DE456E6E2BB89FEB4186FF;// 0x9660(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8085A5349243E8A60988FBD1BD9B298;// 0x96F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F0EF2E54B6DDCD60D7F90B913FCD5A5;// 0x9780(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBCB867C41BAE9428AEBC391F72C3EDE;// 0x9810(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C3FAEE3483FE59E8F7613A71FAF9249;// 0x98A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB60750348AC1A4FA5CE91907AA959C9;// 0x9930(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB4EAB4747F2E313F4C7C292E17C91EF;// 0x99C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34BDE14342FB0BC1BD53A2A0BE4F9FE9;// 0x9A50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_167D46194135C4B404FD2A8CFD4586D6;// 0x9AE0(0x0090)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_64C6D0384DFCD55CFDDA1AB7D9C3DBED;// 0x9B70(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_707C46F948FD2D0DB30EEB812CDF51F1;// 0x9DA8(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_DE3ABF09407DF8FBD31A1D9CE6287184;    // 0x9DF0(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_BBA83AE04AD8953742D7D1A3D0A6AC76;    // 0x9F90(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_6A6D2FB147A29625161A7D9C15F8936B;    // 0xA130(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_9B0BDCFB45E74BCB7FBB65A73CAAF3B0;    // 0xA2D0(0x01A0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_6F71F87047DE9DEBDD0281AC1AA22901;// 0xA470(0x0038)
	unsigned char                                      UnknownData03[0x8];                                       // 0xA4A8(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_58808CCB4A1B12107FC7DCA01650B8F4;    // 0xA4B0(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6055DD846347479310D439E5C398AFA;// 0xA650(0x0048)
	unsigned char                                      UnknownData04[0x8];                                       // 0xA698(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFCD792E404C2A18F093A1B46DE554F0;// 0xA6A0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395315;// 0xA730(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE5;// 0xA8A0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395314;// 0xA8E8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE4;// 0xAA58(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395313;// 0xAAA0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE3;// 0xAC10(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395312;// 0xAC58(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE2;// 0xADC8(0x0048)
	struct FBendAnimNode_AddAnimGraphTags              BendAnimGraphNode_AddAnimGraphTags_DB3D834F4207BFFA0AE8C3BAE68831BF;// 0xAE10(0x0068)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3B9C9E5548660EB790C8A6A1EEF46096;// 0xAE78(0x0088)
	struct FAnimNode_MultiAnchorSequence               AnimGraphNode_MultiAnchorSequence_D8446AA849582B5A51D370AC672B53A0;// 0xAF00(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6FAC0DCB43A0C4422A81A7AC4A79F6D8;// 0xAFC8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_2C71FAE14D78E6FBE0C424A7EF95AE19;// 0xB010(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED534FB64A536F475BFC79BCFF7CB8BF;// 0xB048(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01600316484BB2A9840612A788635D62;// 0xB090(0x0090)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_E448336641E298CB8719C8A1F465DE3B;// 0xB120(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D7C34B15478BE99663493A894C10FAC7;// 0xB358(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55DBEE99463BC81F1AB37B991CFF7358;// 0xB3A0(0x0090)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_CD29CC1141E92D5AA4EF6A83857EB990;// 0xB430(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2B512DB4484175B7CD8BA18FB543A170;// 0xB668(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_BF7AF8194D18ACD7F0B66FB026B9551E;// 0xB6B0(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_29B497974E7797B5C581AC851455D890;// 0xB8E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F86B7C11409B0646E6C539BE43D3C6D2;// 0xB930(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_649BEB634872E1ED3ACDD3B20D9BA8B6;// 0xB9C0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_25583EC44FE152DDFE4C74AB949180A6;// 0xBB30(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_CF7055BD47A292C43BD0968CD1C3C111;// 0xBB78(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_473A598F422EBE99DE041CA33CDECC02;// 0xBDB0(0x0048)
	unsigned char                                      UnknownData05[0x8];                                       // 0xBDF8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EFFC27314AED5FEDD0958688EB2F6FAC;// 0xBE00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BB04C7F4B59F71D5CACFFB87665B5A3;// 0xBE90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_103D89AA49C48D6E037277BC0E37DE8A;// 0xBF20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93D127694C193BDEB0D70D8E41CF40A1;// 0xBFB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A322D70346396E040D1F4A839C3882DD;// 0xC040(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9545FDC4202AEA26ACB16B7474BFF9E;// 0xC0D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D41C3E747CB409FF2FFEF95531E64FC;// 0xC160(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_215068C14832269289A4958D0CEF4AD8;// 0xC1F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D1239AB47774134402F9D940A74D99A;// 0xC280(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B17AAE56470C191F8CD1139E09D72427;// 0xC310(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F99B1F964A6E2378124F1EBDE2C6D495;// 0xC3A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17601247496F5D0D7D5DE8BB60106294;// 0xC430(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8623CA63421C09BF7BCD6DB3B07AEAC5;// 0xC4C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A656D8F4BDD1DC91F1E21B192891C11;// 0xC550(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D9FD8E9486CF21C54087EBCBD511167;// 0xC5E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5EB3D3040C09805EC0482BC41327142;// 0xC670(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01B8C98E4655D7AE65ABC1981A1EA3BB;// 0xC700(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6AB334E493494E4171D06B3481D3839;// 0xC790(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AA79F8D409714A9C7A107B01518F705;// 0xC820(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5E5E4F84CC2A134FD1E5CB6EA80272E;// 0xC8B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42576D4E4AFA2DE8D136A08874314018;// 0xC940(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC4529724C52DE7CC15CC5AEAC4F98A0;// 0xC9D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FE4F49D4FE104607084D2B3BB29C748;// 0xCA60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C79F0DEE4043AB473DC9E8BCA0A05366;// 0xCAF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_302D43CC42DEAAC726CF589E32DF486A;// 0xCB80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_599A83FA4F8D9498D483CB94E17B8678;// 0xCC10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A43A91346755DF6ACE536A1ADE48FA4;// 0xCCA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D233A80449AFDA472164E083C947E9C2;// 0xCD30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A87CE6034BB6BA504D5424918A307692;// 0xCDC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D6585D3483C071C48FEBDB2EA2EB171;// 0xCE50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40F05F8F44F7D88918E77AA1E2E3C286;// 0xCEE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_00770A644BBDBBDC36600EB56F792CC2;// 0xCF70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261BAF346447DCB404055B6E5A89AEA;// 0xD000(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F49E0BF24B2D249C2B4158B78A5CD64D;// 0xD090(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84A7623E4D7A03541EA48AB68B1EDE65;// 0xD120(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE39531;// 0xD1B0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE;// 0xD320(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_ECA1BC06499E8B795EE2F8933127C9E4;// 0xD368(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_267568EB4FAA22AB41990FBC750F0CE6;// 0xD4D8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9D77B634847473A4AA19497EF19C7BD;// 0xD520(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E7BE0F8A45554FDDE9D55B97CC6630AD;// 0xD568(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_929ECCA2443DAD6965F488BA1A3DD550;// 0xD5D8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF18B3AC49D5D6C089820AAF185753E8;// 0xD748(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_D5FA77D94E723EF5030DAFB242505EDB;// 0xD790(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_35C3C8DB4D2853F36F5AEB87CC9A5EA8;// 0xD900(0x0048)
	unsigned char                                      UnknownData06[0x8];                                       // 0xD948(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A04033EF494EE89C0B2FEA97017477A8;// 0xD950(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F451A634D0F4BD5C8A075A9098C375D;// 0xD9E0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_3B3B4E724F629DB99A6D7681852275B7;// 0xDA70(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_322AE57849D768947BE71A95339A6EB5;// 0xDBE0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_3D9B141949CBCCA6444D71995137E9B2;// 0xDC28(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_158951F6430E2AB80A310D845D0E1D12;// 0xDD98(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_90526327436B175377FD8893BCB2CCCE2;// 0xDDE0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0371FC68476EEA078FF59DA5285009702;// 0xDF50(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0818CC114CF29C4AA877E39D9EF3408C;// 0xDF98(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_754D5CEE48F90E52A53264808B225D6F;// 0xDFE0(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_99E78310425F58B4A2CC12B657DFC278;// 0xE050(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CB68D2BF489DF749BDEDBBA3FD30A451;// 0xE1C0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_90526327436B175377FD8893BCB2CCCE;// 0xE208(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0371FC68476EEA078FF59DA528500970;// 0xE378(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_2E8B7419413411FF59A2A8BA433204EA;// 0xE3C0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_13D33FB7405C7665B7341FB2821CEB16;// 0xE530(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_07ADC9634A41AD24758EE58B0D89F1F1;// 0xE578(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F38D9C1446FC3DEBFE360FA822480CE7;// 0xE6E8(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_DEDFACBB4E3E47CAF43C7888DEFB8281;// 0xE730(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FDCA2311463F395FACA7E680B7566F64;// 0xE8A0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_448E98D1496E86D800BC5C9717EB5D37;// 0xE8E8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9B4CF97944A7A1805B231E985882FEC9;// 0xEA58(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E3C554924B96997C87D708B4AE7E7844;// 0xEAA0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0896509248408CAFCDD0A59A2503A9BF;// 0xEC10(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_D53FB7E4411A08BF4DFCD0AF68436536;// 0xEC58(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_22E1CADE4BA1A8B918DE618010FCB2D9;// 0xEDC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3AC2AF24A5CB7E07EBA1E909021C157;// 0xEE10(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_21DC45084C9B134766BFC9B965571A12;// 0xEEA0(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0C7B8B3046D286032EFE99A99C83B39C;// 0xEF90(0x0160)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF9DFB9B45D8B42169611BACE9EC0BFE;// 0xF0F0(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_591A999A421816193445D2BC75ECFDE6;// 0xF178(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D9E7C47D47ECD9C1F7479FAB79B57589;// 0xF1D0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_489B97ED49C07B351213B38385282B8C;// 0xF218(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E203EDD64B9D6151A1ADBCB9C8CCABE0;// 0xF388(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_79A68AAC4F996E573B0D2D8D44AAEC5F;// 0xF3D0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2726343E4FA5C6060E7D9EACBC1FAAF2;// 0xF418(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D5CA14D47D52E902CC7B49A40EA2FEF;// 0xF460(0x00F0)
	struct FAnimNode_RandomAimOffset                   AnimGraphNode_RandomAimOffset_41A8162B4B342B119F0F91A680862AEB;// 0xF550(0x0250)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8E40CFC5463D575D2055B1AC94130AFC;// 0xF7A0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_2B49EF5B4CA48771A8C49C8873F459FE;// 0xF7E8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_33675FFE47D5A71072A08FA51FF0D5A2;// 0xF820(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8BE5A78E4EECF9DE776099B6690A5402;// 0xF868(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7DBB5A094586C3B5A0A2DBA198373716;// 0xF978(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_767B78764C1FEB8F4B9127814BB5DFC4;// 0xF9C0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_23ED570D40BB7D1BAD8ADFAC7ECE795C;// 0xF9F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6AABCF1A487577EB08434EA1C829A35E;// 0xFA40(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_Root_0BF05B32450FC0E8A83ECDB98E47DAF3;      // 0xFB50(0x0048)
	unsigned char                                      UnknownData07[0x8];                                       // 0xFB98(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA330B17427A67EA2D5852B0A06857AE;// 0xFBA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF6B4E7A49CEF25F7CF9EAA5E2F583BF;// 0xFC30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60E6FF0C428904239F49CD9322768047;// 0xFCC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B804AAB64DCDF16162E7EFB9F870B899;// 0xFD50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD3A6A7C47EF85E161B0AAB25517C3C0;// 0xFDE0(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6F02CB0F4CA4A469BCE0BC9753BE15E6;// 0xFE70(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_77E4BCA5476B91494A80879836870A5D;// 0xFEF8(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_51F331E14DDF1AA3F18AAE992DD194EF;// 0xFF80(0x0058)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_8AA5A3B244FCD0DE0246BBB00F73B5C5;// 0xFFD8(0x0058)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4DADC14F4D00C7212DEBD493FDD784A4;// 0x10030(0x0070)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_8A1A17C341E23398631FE0AB4FAFD81D;    // 0x100A0(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_FC57D1484845CEAB01D40ABE7AE04038;    // 0x10240(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A0BA2E8F473113B51EB5849B06FDBE5D;// 0x103E0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_3CA7F8404269F4E78BC6E1AABFB74550;// 0x10428(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20A0D57542E17B67FC656D9DD3D52CCF;// 0x10460(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C7239BBD4EB4BF5508F845BAA102ED0D;// 0x104A8(0x0160)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6250AF1A4BCDC675CF56A6A1FBCD26B8;// 0x10608(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7FAE1D384AA18F2A78491389D9F66A68;// 0x10690(0x00F0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_321D80AA4431C019EB8590AC1E571DA2;// 0x10780(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5CDCE42141B12A47E72E6DA6A8CEAD43;// 0x107C8(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F11DD8940FC6E7AFDD2D180A2F800B7;// 0x10810(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_802938134CAC8FA8A6F2488060093B5B;// 0x10858(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_92FA0C014ED45E8CF734DF92AB729CDF;// 0x10968(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6C4A9D7B40DA8D01A98A5CA66E962857;// 0x10A60(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B6D00E4E43B158FF48B35C82C26DCCED;// 0x10AA8(0x0048)
	struct FBendAnimNode_BlockGraphTillSetupValid      BendAnimGraphNode_BlockGraphTillSetupValid_412BAB124E0A3C4BB49C658CD1BD6DF4;// 0x10AF0(0x0050)
	struct FBendAnimNode_SmoothStepUpStepDown          BendAnimGraphNode_SmoothStepUpStepDown_EEAA27D14AEB8F57F2F751A569D91481;// 0x10B40(0x0118)
	struct FBendAnimNode_FixupAnchoredMeshPostCollision BendAnimGraphNode_FixupAnchoredMeshPostCollision_8D0A86184F15D8B881EDE6A3A0B176A7;// 0x10C58(0x0158)
	struct FBendAnimNode_PostPhysicsInitialPose        BendAnimGraphNode_PostPhysicsInitialPose_AB7BC399410BDF935514E8A749B8537E;// 0x10DB0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B66674DE4A6BF6C4F50EC4BB5ACB5824;// 0x10DF8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_ABDDC6BE48CEF178DBEB48AA9268A854;// 0x10E40(0x0048)
	struct FBendAnimNode_PostPhysicsSwitch             BendAnimGraphNode_PostPhysicsSwitch_B09652DF48FFE410DDAB9AA18BD6C047;// 0x10E88(0x0060)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_4FAF50F64E96C9C0F78B608179849460;// 0x10EE8(0x0050)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_BD04EC1B49E3DE76D3207E82F11CF01C;// 0x10F38(0x0050)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_690EE07F4B05C661262288BE5A7314F4;// 0x10F88(0x0050)
	bool                                               Initialized;                                              // 0x10FD8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x10FD9(0x0007) MISSED OFFSET
	class ADeerController_C*                           DeerController;                                           // 0x10FE0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	float                                              Default_Locomotion_Speed_For_Walk;                        // 0x10FE8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Default_Locomotion_Speed_For_Jog;                         // 0x10FEC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Default_Locomotion_Speed_For_Run;                         // 0x10FF0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Was_playing_Perform_Action_In_Full_Body;                  // 0x10FF4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Playing_Perform_Action_In_Full_Body;                      // 0x10FF5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass DeerVim.DeerVim_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeerVim_AnimGraphNode_BlendListByBool_55E68B0C464827C0158CAAB882C4F3C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeerVim_AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC_4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeerVim_AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF_4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeerVim_AnimGraphNode_TransitionResult_AEE576094060854384E169A4107B79BC_3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeerVim_AnimGraphNode_TransitionResult_E1E98E8444A1DDC03D6FEE99E8226EEF_3();
