#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct UI_HudVisibilityOptions.UI_HudVisibilityOptions
// 0x0010
struct FUI_HudVisibilityOptions
{
	bool                                               ExcludeMiniMap_11_9D44CCDC44368BD0669E3899ADD2A129;       // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeWeaponInfo_12_2FBE40EC478E91463122C4B2FC86E517;    // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeNotifications_13_12004AF74F3AF5E9A9EDB7A37EE262C3; // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeTooltips_15_226315FF4745BE7D049D8A8587B13B91;      // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeNpcMeter_24_0220B6DB47C5BF68437E7BB785DC832A;      // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeXpMeter_17_F546E21440807F9F2D2B46B906B8D679;       // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeReticles_18_4DADC523480BCE7A841809BDBC73A9D6;      // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeLocationInfo_19_3423F0F3443107996AB622B09EBD91F6;  // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeWaypoints_20_9CA44F034F26968D2EB5138B5DF9E4DF;     // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeCallouts_21_3F50FB214F21216C02F5C3A0C259F6B7;      // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeInteracts_23_63E1FF114479EA8BB19009B28CEB58A1;     // 0x000A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeStamina_33_222B98344D8F8D6AA18F80AEE7E7C229;       // 0x000B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeAdrenaline_34_DB8181C34D5CC4C59C6F3AA3D960187F;    // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeHealth_36_0C19B62C42D7FC581E0AAFA08D6011D9;        // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeSupplies_38_B50A6C68482BA8DC38D3E5BA46650A26;      // 0x000E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ExcludeWeapons_40_ED1C205B42BF0BDD9EE8BF998DFBEB2B;       // 0x000F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
