#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct vo_nero_intel_struct.vo_nero_intel_struct
// 0x00C0
struct Fvo_nero_intel_struct
{
	TArray<struct FString>                             CaveLines_3_7BB3097848400678284038A3C1B64C37;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             DeliberateLines_7_1E92A95B43F1B63ACA756E8C281E25FD;       // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             MemoryLines_11_42FCD04B491CBFB51A59298569BA8C55;          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             NestLines_15_87B9EF414AE2AD5E7A5118963BDC515E;            // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             ScatLines_19_A81C7DE2461695E26B97C1897A685514;            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             DeconLines_34_B5BB0B414B15611F2352FAA19E855A5D;           // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             DutyLines_36_BA445C524714D8532F1DB88E35F5F99D;            // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             HordeLines_38_60895ACA41026843CD71248A7A144CF4;           // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             RebelRockLines_40_A70DDE064AD83A04529125A0217907FA;       // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             RosterLines_43_D0E4965D4D92D7DEE1F36AB4E68CCF83;          // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             TaggedLines_45_ED40FB664308B5A27BEEE886126531C3;          // 0x00A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             OBrianLines_49_CDDDAFE24DA78525F0B6DF9D7C5BAFA9;          // 0x00B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
