#pragma once

// DaysGone (00) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass WolfVim.WolfVim_C
// 0x17620 (0x18910 - 0x12F0)
class UWolfVim_C : public UBendAnimalAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x12F0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5D5BF4A1481554FB31A7AB990425EF6B;// 0x12F8(0x00F0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_885F225F4846D4F00B4DCB86836693CD;// 0x13E8(0x0038)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B91D87D54E06A22E38DC8DAA8405BE84;// 0x1420(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_221B3198421A719EFFE7949D63958D01;// 0x1468(0x0070)
	unsigned char                                      UnknownData00[0x8];                                       // 0x14D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1F2ED5F46244DE30E6C5DB5C8948FFB;// 0x14E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A114E0CF45F52F82B9097BB65C597F6C;// 0x1570(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_369DC277466CE923EFAEA1A0E2BEC173;// 0x1600(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_41AF10E144105F642008AAB3F4063813;// 0x1770(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_B9854B5F45ED61629E8829B51F2B941F;// 0x17B8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_942E017B4A24872DE2C8E3A30FD93A2D;// 0x17F0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_303369F34CE62DF02F7A779537ED1666;// 0x1838(0x0110)
	unsigned char                                      UnknownData01[0x8];                                       // 0x1948(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12FD85EF4436406827007CA761320A42;// 0x1950(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B68C3FE54737F495392A23A4336370B5;// 0x19E0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_38F6D08B489F0AD85776EF9B29841349;// 0x1A70(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FAD29D8944E503233F1ED596F6E44F5D;// 0x1BE0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_9A8CE99747B3DD4A1416D5AAA613760F;// 0x1C28(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_86B857534C2CFE5FDEF3D2B474F6DB58;// 0x1C60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_51A721BB4DA7C004358DF1892D41E9C7;// 0x1CA8(0x0110)
	unsigned char                                      UnknownData02[0x8];                                       // 0x1DB8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88505BBE431045BD48EE8584F10CDB67;// 0x1DC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E12B8DA1443407D83D7F309EE815A33B;// 0x1E50(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_6675C2EE453FC618FEFFA3B8B5AA66EF;// 0x1EE0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE4880B44C5B0C674D93AC897DF4E62C;// 0x2050(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_70AE0BCB427E47EF251C84882A798623;// 0x2098(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20BE384344F11D09EB86A5A66130AE53;// 0x20D0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B7637B794B7C94E81C568E80FF949DC1;// 0x2118(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5D0F7E1842E299FE0028C5867371B8C5;// 0x2228(0x00F8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_37E171D44416D0F2389BC0BD54D0D0F1;// 0x2320(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_79D119534B5438104A6BD2B88678EB23;// 0x2390(0x00F8)
	unsigned char                                      UnknownData03[0x8];                                       // 0x2488(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D31ED524AE0E18EA1886F9CB4B61232;// 0x2490(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18B6D9D94D9E5981F7EF7EBDE7D9D6C4;// 0x2520(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_59B3FAF245ED5BE2DDA57FAB7D768B12;// 0x25B0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_00A59E4B493C9B03ECE7679352265663;// 0x2720(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_5D920CB34428E92C97A9D2AF47484688;// 0x2768(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_82CCAE854A81E29B78CCD984294F3EA2;// 0x27A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_078B45204E50EE0A13FBAAB237776628;// 0x27E8(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BBA6F9164DED2F5B6EB8468C30D362D6;// 0x28F8(0x00F8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42576D4E4AFA2DE8D136A08874314018;// 0x29F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16535E3B449BE04B912CEC9284E8F8E7;// 0x2A80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1FE5AF64042B979FCC25E8F43B1FB2F;// 0x2B10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C53AB9646A9A2400C1E4C93E84BA7DA;// 0x2BA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C27DC514225DB22188783B39E9D3C54;// 0x2C30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF3EB6C64B53571E282C0DB84A319CA3;// 0x2CC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E9AB9A54A18909E98BC9DBDBB239BC0;// 0x2D50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DB3569948EFBB75701E30888898F028;// 0x2DE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FA7BA8B4783FDBF6692BD95CCAD5637;// 0x2E70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6488B874435534E952D8CE85820376C8;// 0x2F00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A63A17E448631FD27382DE8CFB92EE06;// 0x2F90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC88B83A4EA8FF475863BE86A6B22A63;// 0x3020(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10CC47CF45AF00677E45318485DBB027;// 0x30B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F81CD604444770A7A263A8A71AC6D9C4;// 0x3140(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0103FFC4A37C0AD61A897A70B5CBAB6;// 0x31D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_987E5A7F4C59BF5DE933959DDD8E2441;// 0x3260(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F6533904104BD4700428E8B63DA363F;// 0x32F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81BE7684482239BA8E39BC94EB90BD2F;// 0x3380(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13393EEE4B4C04AF8E758FAC59A7F610;// 0x3410(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E4353CE46818443346CD6953444766A;// 0x34A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1D0BDED4E210F9480BB109D6873103B;// 0x3530(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC8233FE41D2DA0570AFACA2FF3700BE;// 0x35C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53B89BCF4E2E08A70DDD3CBC384F515D;// 0x3650(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB57035D439B9DCB01F6BC9729523929;// 0x36E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F336F5A432A93EFBE7C57ABBCB1D3C7;// 0x3770(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_374DE18440FDFAF11F527A99AB745B94;// 0x3800(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3AF1AC14B30D93F2B2AAF8EA2DACB38;// 0x3890(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1D5D4A345189153E4ED6BAA21D92E12;// 0x3920(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0D045EB49E8685D002B5A9AEDC2A004;// 0x39B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A46BB4714165EB5923FB2AB693E16DCC;// 0x3A40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE6AA816464832B2627741A1D7438A33;// 0x3AD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97B450AE4B2115B1BD711A928439556A;// 0x3B60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7919815047F88EC648D8CFAB982224C3;// 0x3BF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE6BDA924FA875C7D49859BE2B6EF680;// 0x3C80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_532661B440DE763469B14FA10FF7CE97;// 0x3D10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3AC2AF24A5CB7E07EBA1E909021C157;// 0x3DA0(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_059AAF1E4E652C9358E6C8882935A80A;// 0x3E30(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA47C3C349ACE922059A689EBAD39F33;// 0x3F20(0x0088)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_922D95E644A01B971FC0D2A28179F7A7;// 0x3FA8(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D9E7C47D47ECD9C1F7479FAB79B57589;// 0x4108(0x0048)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_DE3ABF09407DF8FBD31A1D9CE6287184;    // 0x4150(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_BBA83AE04AD8953742D7D1A3D0A6AC76;    // 0x42F0(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_6A6D2FB147A29625161A7D9C15F8936B;    // 0x4490(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_9B0BDCFB45E74BCB7FBB65A73CAAF3B0;    // 0x4630(0x01A0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_6F71F87047DE9DEBDD0281AC1AA22901;// 0x47D0(0x0038)
	unsigned char                                      UnknownData04[0x8];                                       // 0x4808(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_58808CCB4A1B12107FC7DCA01650B8F4;    // 0x4810(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6055DD846347479310D439E5C398AFA;// 0x49B0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395314;// 0x49F8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE4;// 0x4B68(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395313;// 0x4BB0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE3;// 0x4D20(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE395312;// 0x4D68(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE2;// 0x4ED8(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_005E1B57424BEF4A20B11C87DEE39531;// 0x4F20(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_37DBE72548921360F8A632B8B601DFEE;// 0x5090(0x0048)
	unsigned char                                      UnknownData05[0x8];                                       // 0x50D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFCD792E404C2A18F093A1B46DE554F0;// 0x50E0(0x0090)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_E154D9E94CC708DE86D42F9E0D9CB83E;// 0x5170(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3FD72A1C4079F5DA6B90778A4E0BF6FD;// 0x53A8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_72B24AD947D0AF98B940B7BA9A38E854;// 0x53F0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F0D9BB445558EBCA552068C99781D48;// 0x5428(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CCDDFC54FA2FF505607DDACF8B6C5AF;// 0x5470(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0BE5B64242205E1F63BB70AC30BD3C29;// 0x5500(0x0090)
	struct FBendAnimNode_AddAnimGraphTags              BendAnimGraphNode_AddAnimGraphTags_5524A5134319270397182B8766A1D901;// 0x5590(0x0068)
	struct FAnimNode_MultiAnchorSequence               AnimGraphNode_MultiAnchorSequence_D8446AA849582B5A51D370AC672B53A0;// 0x55F8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DC125C7408286B948C028B24E5BDF82;// 0x56C0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6FAC0DCB43A0C4422A81A7AC4A79F6D8;// 0x5748(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_570EAA2649D4FEF81CDBA79FD3709828;// 0x5790(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_6CE4ED314C4B47E0DE1CBF99BB24D3E7;// 0x5820(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DD97B8FF42E0D40C11E7E39C741B25C0;// 0x5990(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_89B876784C8CC9B6896042B6E8934D782;// 0x59D8(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_74D1C5624468630974CAAEAF94EB8E322;// 0x5C10(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_15313ABB46731FAFBD586BBD89A2F80F;// 0x5C58(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_96DB5DDE48EF231D69E9A49E6FB47056;// 0x5DC8(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_FC7EFBC8436D2CAFDEECF2A8974206F6;// 0x5E10(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1D72492D4BD193B2792C38ADDF3DDF39;// 0x6048(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_24FECC8746C213F01B4972AF678AFD1D;// 0x6090(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59972B704183D91574283488A7FFC9A2;// 0x6200(0x0048)
	unsigned char                                      UnknownData06[0x8];                                       // 0x6248(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0349F54B4D26892B8ADF7A99290E114F;// 0x6250(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91CC593C4701553ABDA4E4A934375D01;// 0x62E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_805385C24B1A7A8DBE12D38AC145962B;// 0x6370(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6C00BBE4C2F9B9AC477C7855B518E99;// 0x6400(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B09AAD494F9473EA8D52499D2B59CACC;// 0x6490(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_883FAA1046AC6DC92BF2F9976260D794;// 0x6520(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF0A700D4D0B6EAB7EF5D5B9DCD25BC4;// 0x65B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BEABC7F49A389F7A46F9F9CAFF6FCCA;// 0x6640(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16D854A2468EFC1D0505DA885D03D900;// 0x66D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6537293C4964A96D32C566AD6376B323;// 0x6760(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_394CC7EF49226AB65337579A6A25D584;// 0x67F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C10148448009DB70505228492475EF3;// 0x6880(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16A99272459C66639633C28D8365FDDD;// 0x6910(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1566A24C49D9340E060FA7BBEFF4FC67;// 0x69A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A2DC975496C3870A0478FB7DFC826C3;// 0x6A30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC4BABB64109577A5350FF9A117815AA;// 0x6AC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7090C48B4EFB178686F1A8BC56E6C64F;// 0x6B50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4954FD347858D0F3D00F9BC6827D29E;// 0x6BE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5FF79CA4D2017A393AFADBBC91C738B;// 0x6C70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_074C796D4469E847CE4482988D4C8D89;// 0x6D00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D445102A46284959A50FA5A69DD19E2D;// 0x6D90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7A93A0B457B253B94F4E8905C34F446;// 0x6E20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F96CC654910EBB3E8A1FAB3D90AA506;// 0x6EB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F30CA312484699B0D2D55E9902BCF5D5;// 0x6F40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC26DD4C4D2032C60D078491B462ACE2;// 0x6FD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B9AA610A4A8E1B3F3CA578838E29C5C6;// 0x7060(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F8ECC8B4900A759EE54A8B4978A5F64;// 0x70F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91DA837C43209B4D825BB089B5C7B0C7;// 0x7180(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D151DCE24DB67243CC43BCA07441A0B7;// 0x7210(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3D4B1B844D30BFC9B96BE830357E62D;// 0x72A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0DF93404256EDB10BAA948E6A83B6E5;// 0x7330(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69140A4C4A368A840447078812DDEE28;// 0x73C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E80495AF429BBCFFF5F3D9938286423F;// 0x7450(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C450DC64392CAE2D6AB318CB52B1613;// 0x74E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D2E72E8944B665B632628392519C976F;// 0x7570(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A2DAB774A5A66AA00F1C99F4A1DF211;// 0x7600(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A02AE550493526E4C7DBFFA16CAEDECA;// 0x7690(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_419DD10744DF0E41B59E25AF6A3283F9;// 0x7720(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2E6697441771AEE3083B5AEE3A8EDFB;// 0x77B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D878F8174152B1164B4F738F174C85D7;// 0x7840(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F0572444338EA79A480B8BCC8089FD9;// 0x78D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4CB0B7EF476CAD45D0C9018C3E7033E6;// 0x7960(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1BAECF84FAFF4DEA12E709CFA5F5CE2;// 0x79F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAE9F94D5FCD0DC6951B836FA5FAA6;// 0x7A80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6448E73641BB7201FF2C2297A12CA639;// 0x7B10(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6A2A8C44D9A4C11C419E4BEC9A7A6F8;// 0x7BA0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77740D7247A95EA3B245DD92E01FD8E5;// 0x7C30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D48ED0EC4DA29DD9AC0264A2D14EB5B2;// 0x7CC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87A36BC7449B8741504D5F81F5CB94F4;// 0x7D50(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D471103645C8CBFC399D109B781234EC;// 0x7DE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4DDA0D1546F9E92E7258BB8FC42F24D6;// 0x7E70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50C996E34874A02117299FA3560D24FB;// 0x7F00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C4B57D74D9C30F212DDB5943F4D491C;// 0x7F90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_037BD77F4DD1A638F9F970BF4591F325;// 0x8020(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FDEAD624526F938DB5E76A7D79801D0;// 0x80B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98AAB55B458AC8C6A00EF7A66AF6BBC9;// 0x8140(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27F2B07246F9572CAB1C43828659E732;// 0x81D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88B26789442BCF118EF06290CDDD8116;// 0x8260(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7578EBA14D285BB81913B3B2191E9050;// 0x82F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C185FE04DF081F74A55EDA6D2A83D7C;// 0x8380(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9E7FA81428B6A0AB8D525AD25EB954B;// 0x8410(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D6585D3483C071C48FEBDB2EA2EB171;// 0x84A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B49DE9B04E02AAB7AFBDCABF97DFBD91;// 0x8530(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B849BCC46539D640944FCAA9F4BB240;// 0x85C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B565A3F487F8D4718967DA4B5460EDA;// 0x8650(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_323EC18746CF51A0B2E6BCB22233B0AA;// 0x86E0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_C6F724BA41E3ED8C1DF87F92BAEC2073;// 0x8770(0x0170)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_829F34684842E7D20FA58B8EEB187117;// 0x88E0(0x00F0)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_64E0E76C424DF65B64F12AAE94369E92;// 0x89D0(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4E3960E342992CD0FDEC7E8DA93D71A5;// 0x8C08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72D66B33458A9822E3B642A662F9D4FC;// 0x8C50(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E07948CF46B90F761239C5A3B43EE873;// 0x8CE0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_90F41524492F6ABFAAE477BDEF459B2A;// 0x8E50(0x0048)
	unsigned char                                      UnknownData07[0x8];                                       // 0x8E98(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_B26B8BEA461A31DA5A000E8DF30F4695;    // 0x8EA0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_794B308C4E284FF1E14261AE522C9E77;// 0x9040(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1FCE0DB04394C7E113E1A79E3A24E52D;// 0x90C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9573A7A040124101A08762AAD57423A4;// 0x9110(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A04033EF494EE89C0B2FEA97017477A8;// 0x91A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F451A634D0F4BD5C8A075A9098C375D;// 0x9230(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_3B3B4E724F629DB99A6D7681852275B7;// 0x92C0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_322AE57849D768947BE71A95339A6EB5;// 0x9430(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_3D9B141949CBCCA6444D71995137E9B2;// 0x9478(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_158951F6430E2AB80A310D845D0E1D12;// 0x95E8(0x0048)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_B84AC53B495C7C63B07491BEB3296072;// 0x9630(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_663A5BCC4DA4BE0ECEF52F8F082E815F;// 0x9688(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A00E34943148B0AF39BC4B505E06F43;// 0x9710(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5CEFE4A34A249DB5B7555AAA782EDA9C;// 0x9798(0x00F0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_336DCEEA4D7793E7F8FDE2B445DEB15F;// 0x9888(0x0048)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_1D38A6A940B002095BF489966A93ED4D;// 0x98D0(0x0058)
	struct FAnimNode_RandomAimOffset                   AnimGraphNode_RandomAimOffset_07779A634C508C03C0F46BAB0A6F4978;// 0x9928(0x0250)
	unsigned char                                      UnknownData08[0x8];                                       // 0x9B78(0x0008) MISSED OFFSET
	struct FAnimNode_AnimalAttackAssetPlayer           AnimGraphNode_AnimalAttackAssetPlayer_765966084698B28CD63CED9227E8871E;// 0x9B80(0x0880)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E6030B2D409E2F27E1AD8395F0EB68DB;// 0xA400(0x0048)
	unsigned char                                      UnknownData09[0x8];                                       // 0xA448(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A155440C4AB2477876968C9F33FF6490;// 0xA450(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D4E12EE48FA75239B343288C290A8BF;// 0xA4E0(0x0088)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_0E4C91334698717C0E048EA2FB87278D;// 0xA568(0x0070)
	unsigned char                                      UnknownData10[0x8];                                       // 0xA5D8(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_5EB48F774E2231B1FDD56FA03299AF92;    // 0xA5E0(0x01A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F78905534179F449BED97C8D05228D43;// 0xA780(0x0088)
	unsigned char                                      UnknownData11[0x8];                                       // 0xA808(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_DA13D97B431FA847F48B7C8237691A1B;    // 0xA810(0x01A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_866E1A8D4BF8F025D7FF24BE66308EAD;// 0xA9B0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F768C8040CBE92894BB45A67FE7B50D;// 0xAAA0(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_9FA450874C22F204A6566D9B31948BFF;// 0xAB28(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8BDA08064EDF4CD21C3C29AAD0621877;// 0xAB80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EDD0CC1A4D88E6B943BD0AA8534BE186;// 0xABC8(0x0088)
	struct FAnimNode_OffsetStartBlendspace             AnimGraphNode_OffsetStartBlendspace_AEDABF98499D9328B1C197B3D3788203;// 0xAC50(0x0168)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B68B6B5649E297CDCFBA0986311E34A8;// 0xADB8(0x00F0)
	unsigned char                                      UnknownData12[0x8];                                       // 0xAEA8(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_45CA6388420931D0389D86A4A09A18ED;    // 0xAEB0(0x01A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7DBBFA3C45D85146DDA1C692FE82C385;// 0xB050(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1875102743B6A1161C297B8311BE66B5;// 0xB140(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_397CFD2B4F83D0106A8E0A81ED189F4B;// 0xB1C8(0x0058)
	struct FAnimNode_OffsetStartBlendspace             AnimGraphNode_OffsetStartBlendspace_AF26BCB04968CB73590D0AB5DE81B975;// 0xB220(0x0168)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_42C6365F43C594372D96D0B6EA6FF30E;// 0xB388(0x00F0)
	unsigned char                                      UnknownData13[0x8];                                       // 0xB478(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_4D64E2574A1257F7DDD77E80DB0820FC;    // 0xB480(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A191223452B5D2D8BB50BBC9DC36ED4;// 0xB620(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88C3DDAD4BC07DE3D5D2649D71933E1C;// 0xB668(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_74A467A6415D324CDAE804B964CFF03A;// 0xB6F0(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E653F2E4634D6611AC96AA5B039B5C1;// 0xB7E0(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_624149934EE95EE71B2C6892B984E531;// 0xB868(0x0058)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_C8CB62324A4B2A5E9659E2B1277BF8AD;    // 0xB8C0(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4DD2273C4033140E2347909D1D57EE6B;// 0xBA60(0x0048)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_5B49046C42D7C0A74899729E67FB31B5;// 0xBAA8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C85EE0E4440F325DAEA592856BF0E0A6;// 0xBB00(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E93D815748B09BEE4DDB0585502ABFFB;// 0xBB88(0x0048)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_CA9AC2F84E0D8459BACB34BA9BF85803;// 0xBBD0(0x0058)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_517E75B14F009D507E9357B7123D5C7B;// 0xBC28(0x0160)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EC31E53746015137EFBF499221FAF47A;// 0xBD88(0x0160)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_646B7F1F4344145F3A008E9B6A34E006;// 0xBEE8(0x0070)
	unsigned char                                      UnknownData14[0x8];                                       // 0xBF58(0x0008) MISSED OFFSET
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_70ABCD9E49CA666FB32CEDB847C2F6A3;    // 0xBF60(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_5C990FFB44AF515CEFA6EEB7FBC514CE;    // 0xC100(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6E976727479E2C568D74CDB588CE8DC7;// 0xC2A0(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_89B876784C8CC9B6896042B6E8934D78;// 0xC2E8(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_74D1C5624468630974CAAEAF94EB8E32;// 0xC520(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_F2A1CB274DBDE2D786C97C98D250B4B6;// 0xC568(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B78F5B094FF86A546D7E6B84B0BD1C84;// 0xC6D8(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8602E08D46D92961E8462F8335331524;// 0xC720(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3B534A4B4F46EE61BD37CD9C819E03C9;// 0xC890(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_345D41D94773A2970E26D18E993ADC0A;// 0xC8D8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CB9AD59241C16C5812A5599300DF69E3;// 0xC920(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_452C98E34F5EBEFE3222CABB83E5168F;// 0xC990(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_89346A734C6EC7DCED563DB1FA73C70B;// 0xCB00(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_513E4489472C3EFB18AEB6BD513B8CC8;// 0xCB48(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_ABCB985E45AC8B52C6F849966BC22FB8;// 0xCB90(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CC678DF448F4878AD1C7AABA9BDCCBC;// 0xCC00(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7AF1D9804957A3CAE29EF48BCFC3507C;// 0xCC48(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B4AD41E44CC1E599274530A16CBB8F1B;// 0xCCB8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1CE35A3E45A37DE23A24A1BA02F252DE;// 0xCD00(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_9CB0A68740F4A08BE0E4789B86F641EB;// 0xCD70(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1C1743944739EB9A5E661D804CF8F260;// 0xCEE0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_EFF0E63E42E20D34896D58A7FB42B130;// 0xCF28(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_15B4342946C201AD0C46F0A209A8BE8C;// 0xD098(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_8527DE924017A8C435BB69A2C89E36BA;// 0xD0E0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F871BD0F4110460B9112EDA18917ED15;// 0xD250(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E3C554924B96997C87D708B4AE7E7844;// 0xD298(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0896509248408CAFCDD0A59A2503A9BF;// 0xD408(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_3D33B9B34DC5691C871561AEC0D0BA81;// 0xD450(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8774E3F942CF6BA2954F1BB07C294CB7;// 0xD5C0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_017BE1F74ACFD3E626AB75971D70906E;// 0xD608(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C18F9C7E4511A264E7738297F3E814A1;// 0xD778(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_74190774482A257E23EC59B1620300DB;// 0xD7C0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_02DD3F7C4A60C4B772BA48BFEF0EFB17;// 0xD930(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_42AA558D41AAA5A4EB4F4B8EBD58533A;// 0xD978(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_230F5368497CD25862ED72824B653646;// 0xDAE8(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_5F462FE142C49B8C126BD28CF23C20F0;// 0xDB30(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F9630848429AA3AADE3B38B4188BAE38;// 0xDCA0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_D53FB7E4411A08BF4DFCD0AF68436536;// 0xDCE8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_22E1CADE4BA1A8B918DE618010FCB2D9;// 0xDE58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_982D94A74F0865C1CB1D83874D49BC07;// 0xDEA0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E81B2769482E1D5AD0FB6AB2CAAAF79F;// 0xDF30(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A78078214143521D9807FCA07E6B5E98;// 0xE0A0(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_0EDE1DC34B89A0A975E7468595D00FAE;// 0xE0E8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_12E3159A4B276B8B9AC18387AFB1CAEF;// 0xE258(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_F48486B04AD536FE10038AB676FFD919;// 0xE2A0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3DCC43B54F21CD8C81A25CBF9292F1E4;// 0xE410(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A4DA732A48FC88AF7ED718A8B43B2D5D;// 0xE458(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_097F68564AA531478FA809ADD381F1A2;// 0xE4A0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D2936CB24BF48BC31864C185E0C93327;// 0xE4E8(0x00F0)
	struct FAnimNode_RandomAimOffset                   AnimGraphNode_RandomAimOffset_5DB8577F438BEF95C9525D9D7E3FD093;// 0xE5D8(0x0250)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6FEF436E4E4A74F45C50059BA7D3ADD2;// 0xE828(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_04269D0E483AF1B5E08AD3BEA7F67FE6;// 0xE870(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D3CE42124521151FC2A026A146E01D40;// 0xE8A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_25D20A414D06A9BEA05EE88545A66229;// 0xE8F0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5DC4C22A4E7DF4EA1247A99905C8C272;// 0xEA00(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_CC04DFFE495DDC2435F02CADE1CEBDD6;// 0xEA48(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DB59DCE246D22B59A1D6249BC91F7E06;// 0xEA80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_55C9982E4E40669A69E4C89E13106C39;// 0xEAC8(0x0110)
	unsigned char                                      UnknownData15[0x8];                                       // 0xEBD8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D095C6EA4B7E9E7AA373C9B35662D017;// 0xEBE0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8845D6C4B8DAA367814428F0EF55E59;// 0xEC70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A23942144C19F133D93FCA899268DE36;// 0xED00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A20113D440F9922E3CBBDABADC0C972;// 0xED90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4D80AAA40802BBA4ABA4199E4F7EB87;// 0xEE20(0x0090)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_DAB97AAE4004DD1D4D854792B32697C2;// 0xEEB0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_16429A744C979D961E38C7A248049F01;// 0xEEE8(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5CA06D24B8D557968F14AAA35301EB3;// 0xEFD8(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C2D63E049DC9724170D889C32FF31BB;// 0xF138(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32171A58486FDA884305EC9F060158D6;// 0xF180(0x0090)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_DEA5C83B4CBAD76C1CA5DDB5BD3632CA;// 0xF210(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CD87DAE546271627F95E79ADD4A5A87D;// 0xF248(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FC364E2C45E0D91304A7C1A167D10739;// 0xF290(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_35A958E24A0FC787DC4B248808E92F36;// 0xF3A0(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_73A7B25F415364517AB67784728E69E2;// 0xF410(0x0070)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_9320F7074C656A35467543AD0A4C10D1;// 0xF480(0x0038)
	unsigned char                                      UnknownData16[0x8];                                       // 0xF4B8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC795BFA469F012A81B4BAAEA10BA0CD;// 0xF4C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0B932CF41FB66176DF051B6DD83A117;// 0xF550(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC2ED7D94A016E6E0BB8FB977EA1ECC7;// 0xF5E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C8BAA344E49C8BE5C174CB8348A6D8D;// 0xF670(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_39A2ACAD4BA28EFED64EFC8632576805;// 0xF700(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C9BFF99C47BF83C51FAA8BAF6D2B79B6;// 0xF870(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_F5A030914859CE7EA063B0AADA28B53D;// 0xF8B8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A26CABDA4DEF6A05EAAEC4A30F2FF5A0;// 0xFA28(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_7EC76C904F2802F203C31C9886682DBD;// 0xFA70(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9D7C5BA8482454045A54DE8449042AB1;// 0xFAA8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_72BA1D7245EF24C3BD3839815AD0F502;// 0xFAF0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ACBE2A004698CBB20ACFCE8F0BD0FDF4;// 0xFC00(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_20580CD9469B4CB5CE039B9147004612;// 0xFC48(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7E4647D04EF6A243F6497A843A5D1EB0;// 0xFC80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D3E205EA407588D0E9A349847EBC96D4;// 0xFCC8(0x0110)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3E726E3A437405049910A1B84A39015D;// 0xFDD8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_846348804CD632F9E0A4478961550B3B;// 0xFE20(0x00F8)
	unsigned char                                      UnknownData17[0x8];                                       // 0xFF18(0x0008) MISSED OFFSET
	struct FAnimNode_BendBonesIKBlendspace             AnimGraphNode_BendBonesIKBlendspace_4D04E1624E5F7463F11621A6A37C80BD;// 0xFF20(0x09B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C3EE339F4DB713E60CAAC0AB11B31989;// 0x108D0(0x00F8)
	unsigned char                                      UnknownData18[0x8];                                       // 0x109C8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6AAD11844AF8819C72BA7A9BA237C7DC;// 0x109D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D93DE6ED4D8924B39DBFAB8A6A5A69BA;// 0x10A60(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_D1CE437C44847FFA119870A242F90D64;// 0x10AF0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_201770454D5BE7371C08B7B107CD941C;// 0x10C60(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_7EDF3C1346768D600728C386CC552B74;// 0x10CA8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A33AC0664CD22A4BC77CDFABBAC685CF;// 0x10CE0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D8744E3E454ADE4B4C16C89501813385;// 0x10D28(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E793C3C2497D760FEAE3C1897BDCD74E;// 0x10E38(0x00F8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE7D7D964512BC3BB0AE7AAB153173B8;// 0x10F30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C06DC3294841277E0B7A8CB1EDCE4F3C;// 0x10FC0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDCE97504695B9E1C5C9FEAEF52AF53B;// 0x11050(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28DDDC6C4BF7C7754A1D8DBD038D781A;// 0x110E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C9994674D672231E1387793C605C354;// 0x11170(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6908E5A4651A85FCD504794C3F9F89F;// 0x11200(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA0379BB48D23FB7F0513991E1F11049;// 0x11290(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CC1D6AC4E654DA8D272D1939E2661BB;// 0x11320(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AAEB1EEA4608D9E1AACFBAAFD40F42DE;// 0x113B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5DE4D63D4D5AFA53752891B3BC598ACE;// 0x11440(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE22605D48F7CF9295421C8F78858B86;// 0x114D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3FC3E92435254B8C9D769ADE21BD791;// 0x11560(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA9805D64964EA6AF69EB28506FF4813;// 0x115F0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F69656348B52E227A6C93B038EFE920;// 0x11680(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83D78AE04F8CE67B6A9879AFFB772C17;// 0x11710(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA80CA0E4653FE3FC3496FA54C9521A9;// 0x117A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B95BA044D506909709ED8B59FF4CBDB;// 0x11830(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E5E0DE5483351E160DE38856BB7ABE9;// 0x118C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC90BF4F494181F525E0E883ACD1AFE9;// 0x11950(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B96948424C91064E75FF18B7B2911F84;// 0x119E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28630FA64165F98119D8DCA6C3FA96C9;// 0x11A70(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F942D2A484267D17DA3E2998A7E8AD9;// 0x11B00(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC6A25DD4E558FE6C18CF79CE1ED211B;// 0x11B90(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50D342364FEEEB4B33554C9D9C1E703F;// 0x11C20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55F2F44744B2CD7740D0E2A7040022DC;// 0x11CB0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2D18DF542DAC6EB274EC09442DCE154;// 0x11D40(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BE7777541975DBD5F0E83921679AC0B;// 0x11DD0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99805B92441F43217A82D69AF5488C0A;// 0x11E60(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41D5D89D426E97D1CF347AB7D22B9717;// 0x11EF0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_126565CF4ECA42C6B61981BE51209ED9;// 0x11F80(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA99E61C413B8BF5963771A13A286A48;// 0x12010(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68C85C8E491B0C6FD9B272BC50028E32;// 0x120A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_284C6B664726726966E9678A40796315;// 0x12130(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A89CAF394345642CB674C3BAE2104991;// 0x121C0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_303CA1F541B67D28BA3ACFB8B1AD9230;// 0x12250(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68A494AB4188FDD5BA9B02B061D60B26;// 0x122E0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D88AF70645707EEEA7C57BAC35924DE0;// 0x12370(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCF735CC445FA1B587BCD1987292B34A;// 0x12400(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65AF6275497EF6B69FF01D8CAD7DABBD;// 0x12490(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE2B99E54DC060308E70FE96A33FC03C;// 0x12520(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70DF10B3472A6A80251036BEE08893C8;// 0x125B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB8E3F42437ACA39C9E9A1AA0D3717A1;// 0x12640(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_752C88A1428EE40C3E0192B858BC9959;// 0x126D0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8507A7DB42578F4787B1468B8C762C6A;// 0x12760(0x0090)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_846BD300491D1064FB72708925EB501A;// 0x127F0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DC54201844960C7DFDA27F8685362C70;// 0x12838(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8152D0594D599ADE7A0B4BAA0603C55C;// 0x128A8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0C6DFB0C4257E4E8AE9497949CD2038A;// 0x128F0(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_EEE4E8A740DF4E9192E6A0BED60DE742;// 0x12960(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1FEC8FD0404D95FD22FDE2817FD85B46;// 0x12B98(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_076BCA0D413419AE48BCF3900E470193;// 0x12BE0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4C1FC93342EDDCF4F04CB994B7C39E5F;// 0x12C28(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F9BFEA9E46DAFD5F9CC564B144782C37;// 0x12C98(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_907AEF1746482B41E2BCD6B26E755D9A;// 0x12CE0(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_A48F6B344492C55C1DA9FC80B589CA4B;// 0x12D50(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE0F4B7244E9E8F08E158EA2A1BA26E6;// 0x12F88(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_1CA87C8B43D26CF7F802868EFE1B951B;// 0x12FD0(0x0238)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0ABA34CF4A5C655743A5F8BE71715833;// 0x13208(0x00F0)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_0A84831944C6A757C5DEB7AC975ED715;// 0x132F8(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E9A5C22F4A286B8FCE056EBF685FAC6A;// 0x13468(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_4F30507E43EFD8922218469664A9F105;// 0x134B0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_09D351204527F3BE86CD95ADD4FC2E6F;// 0x13620(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E0A317314C6AA3F581FB91BF615C5A04;// 0x13668(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7C9F64E94FA4557D1A3D90AB9A5C657A;// 0x137D8(0x0048)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_9B1E5E474E14247D039D219423B7A273;// 0x13820(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C13C9A8548774BBB48D1278E03F5E88E;// 0x13990(0x0048)
	unsigned char                                      UnknownData19[0x8];                                       // 0x139D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C7DD2A9F417606FB8B725197763395F6;// 0x139E0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_4B60470643AD18DC76277BBF1CDD8265;// 0x13A70(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3D2AB78545C8658DA48A98B4F53A0656;// 0x13BE0(0x0048)
	unsigned char                                      UnknownData20[0x8];                                       // 0x13C28(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C4259884A84671C80113DB9FDB10F0E;// 0x13C30(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ABE1C3FD427E3DFABCCA78A065871C49;// 0x13CC0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_A9788DF447EF159D8092C59A22B6696F;// 0x13D50(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_328632BA4F1AE117F432FF95BA201D42;// 0x13EC0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5D74C04349A244010ECDE6B298AB339F;// 0x13F08(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9521027C4DCA25F53A3E889F265D5DBA;// 0x13F50(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CDFE07D54ACA1359BE595794EEA66C2E;// 0x13FC0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DC4B21CE409D54FCECE96797274C447C;// 0x14008(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9EC7F65F48DD02D06C7743BEBDB0F87F;// 0x14078(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0969DF2B4F9AB0871584ABBBBA296F1C;// 0x140C0(0x0070)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_CBCA43A5427B81DF7F78FE9323B76229;// 0x14130(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C66DE1A94A4BDD1F828F9BA833DDE487;// 0x142A0(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_B625EB8244485582649A448996001E9F;// 0x142E8(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BAB2773745192460AC21CFA4BF16CF22;// 0x14520(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_FD7E567C4478DD2F4D80D5B43A487D14;// 0x14568(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF2B6315427F6A635FB12EAB7A15C4F9;// 0x147A0(0x0048)
	unsigned char                                      UnknownData21[0x8];                                       // 0x147E8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED9A60494B7688771666048C22F81EE1;// 0x147F0(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_E53232AB48AB32E68DAF1197B5F7A5BC;// 0x14880(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BF50A2EE49116B775DBAD69FFF179875;// 0x149F0(0x0048)
	unsigned char                                      UnknownData22[0x8];                                       // 0x14A38(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0872D43644A3880C0F1C32982769B7B5;// 0x14A40(0x0090)
	struct FAnimNode_RandomSequence                    AnimGraphNode_RandomSequence_BB29B3E14789F81866DA8CB34D791829;// 0x14AD0(0x0170)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_758EE3FB4972DA7EB5C3C69EE8D7E1EB;// 0x14C40(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D11CF8E4D8AA5F7AE5CABACC85964DC;// 0x14C88(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AF91C76E4E2D3701AD7521B0AFCB10DF;// 0x14CD0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5AD05BF840B1691A4D1B63B48C9ABCD7;// 0x14D40(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4470606D4AD2D1E17C7A54923302A847;// 0x14D88(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_71F560874EE193D373A385B60DC22B62;// 0x14DF8(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_87AA02634C164D619822BCB6ED98694E;// 0x15030(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F3B31A98412034308676EFA9741C9C22;// 0x15078(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E92BB3B4444B8F73D381919A4E0374CD;// 0x150C0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9498BAD74BA0D3350023408822AE6F91;// 0x15130(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_857F54C848E0FD153040DF8CDA2C5DED;// 0x15178(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_7B79885645040D0F56F68CB103929DB9;// 0x151E8(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C45E1B4D47D388B6D2274F82C2E06488;// 0x15420(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_64365FBA41924B97217C1AB66E8A9852;// 0x15468(0x0238)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1CDB01E04419C6876A41C5AA77D87C99;// 0x156A0(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_711C73664E148D7F8905EFBDACFCDE79;// 0x15790(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2D654C6840E4E071224C1F8D2462551E;// 0x157D8(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_FA490B85471A26D741F0DE9C47D0D6C4;// 0x15848(0x0238)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_512B7CF643C46732B11A1F8BAAF963EC;// 0x15A80(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ACFBB82B4FB52CD4226D73B814D53786;// 0x15B70(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E3C0657C4FD2C7FC0205F7825FE0B7D0;// 0x15BB8(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2C252C2E42A4F42BAA904883198AD511;// 0x15C28(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_16BDC96D458A402D3C44B09477357E46;// 0x15C70(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_14A287364CBF2EE5E2ED31BE3C4C3AD8;// 0x15CE0(0x0238)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_15AE24DE4D014153D1AAC28861679436;// 0x15F18(0x00F0)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_0011256D4CA8BB06B4943FA4052A4C0A;// 0x16008(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20B65E6544AB85E44CB7A7BA4D59C00F;// 0x16240(0x0048)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_CB5780D44F3BF7DA91BE1396CEB33A5C;// 0x16288(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7A7A69243804610B905CA90A9251645;// 0x164C0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D03EA0D4B4FBD42AA1DB0B881573F4E;// 0x16508(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6DDAB4DF43A2F26250A6AB9CD57527C4;// 0x16550(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47F422DB4885A0BF8FA78D820C7B1DFA;// 0x165C0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4B39462148D57BB6B27CED928091271B;// 0x16608(0x0070)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_0CC737F0433A0A811038F38687EBEAF8;// 0x16678(0x0238)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_64D9C84D4D5BA414363B72B7A377A23C;// 0x168B0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D3330F2743CFC1DA5BC63F9765978DE6;// 0x168F8(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_690757DD4F70D07E43907BBE06C20E26;// 0x16A08(0x00F8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7394572746E2D88DA6F11CAEB1D7DC0A;      // 0x16B00(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C3AAEE344A593AF6B69EC58B57442AA2;// 0x16B60(0x00F0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_67768DA14E28E11FDC7E55B773786915;// 0x16C50(0x00F0)
	struct FAnimNode_RandomBlendSpace                  AnimGraphNode_RandomBlendSpace_B7EAE988402F47892A039DB0F8EBCB49;// 0x16D40(0x0238)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_231F550D4B40DA21145D2DBE668D3A5B;// 0x16F78(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E1B3FB8E45370DA6A7C4E5B6B6863097;// 0x16FC0(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_309534D9481FF5C94DA38C8128A0BDCA;// 0x170B8(0x00F8)
	struct FAnimNode_Root                              AnimGraphNode_Root_6F787E0247ED1CA9EBA0B89C5E8D6018;      // 0x171B0(0x0048)
	unsigned char                                      UnknownData23[0x8];                                       // 0x171F8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E710F892470E9F5A57EE16BBD476537F;// 0x17200(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E518FDC45C7875E281176A99BF1DEA5;// 0x17290(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15E67E764EB7532F362E3B8DEC481165;// 0x17320(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12F3C246444D54810FA841AA766F5784;// 0x173B0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57CB544B4C9A92C54C83A5834C42F772;// 0x17440(0x0090)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8095BFD74E73827EFE756CB4E97FE8C7;// 0x174D0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_543106F84EAB18CDFC64DA9443C9610F;// 0x17558(0x0088)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_51F331E14DDF1AA3F18AAE992DD194EF;// 0x175E0(0x0058)
	struct FBendAnimNode_AddCurveValue                 BendAnimGraphNode_AddCurveValue_8AA5A3B244FCD0DE0246BBB00F73B5C5;// 0x17638(0x0058)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4DADC14F4D00C7212DEBD493FDD784A4;// 0x17690(0x0070)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_8A1A17C341E23398631FE0AB4FAFD81D;    // 0x17700(0x01A0)
	struct FAnimNode_Anchor                            AnimGraphNode_Anchor_FC57D1484845CEAB01D40ABE7AE04038;    // 0x178A0(0x01A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A0BA2E8F473113B51EB5849B06FDBE5D;// 0x17A40(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_5F9E0BC940F22C48A29949868537C00C;// 0x17A88(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_824CA0194259CD2EF9C4A8A688E2EBC3;// 0x17AC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBC5B82A40FCA6B3E8ED4BB1E817E9D3;// 0x17B08(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_84010AD2415C78F36A0654A8C11768BB;// 0x17B90(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B8C97C644BE392019BD4B1A3911771FB;// 0x17C80(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DDE94BB1444E5073E75CA29A2B61B2EB;// 0x17D08(0x00F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8BFC70F145B1F695BAE5BD862F3FBEC4;// 0x17DF8(0x0160)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_08C4B35E410E0EE553840096885EBE63;// 0x17F58(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0C0EC8464A8A9840827994B18F973BE8;// 0x17FA0(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_215F57144B58D8CF059187BD765BB0AA;// 0x17FE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8E47F8D1447B211BC8922FAC4E6534C5;// 0x18030(0x0110)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3A34D8B34FBFB65BDFCB159C2ADF3A55;// 0x18140(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4E3BD9C64C6C25C39387B4943371EAB3;// 0x18238(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9322A0F843D77143900624B6C16897FD;// 0x18280(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91D077054176F30973165ABAB872510D;// 0x182C8(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CB0ECA4645A20281FAE5249E23AD34AE;// 0x183B8(0x0048)
	struct FBendAnimNode_BlockGraphTillSetupValid      BendAnimGraphNode_BlockGraphTillSetupValid_C9E7C97141614FDEBA781096118497D6;// 0x18400(0x0050)
	struct FBendAnimNode_SmoothStepUpStepDown          BendAnimGraphNode_SmoothStepUpStepDown_051B8CC545387A1EC910EEAB5445A132;// 0x18450(0x0118)
	struct FBendAnimNode_FixupAnchoredMeshPostCollision BendAnimGraphNode_FixupAnchoredMeshPostCollision_6015A07F4CF7F8D85BF0DBB005A2BE68;// 0x18568(0x0158)
	struct FBendAnimNode_PostPhysicsInitialPose        BendAnimGraphNode_PostPhysicsInitialPose_1F8541C145A3B91B5CA606B14BA0CFFB;// 0x186C0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2005EA56446782CF7AB32C8370C0F21F;// 0x18708(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CA8660BD42B7B11575C270AE2840292E;// 0x18750(0x0048)
	struct FBendAnimNode_PostPhysicsSwitch             BendAnimGraphNode_PostPhysicsSwitch_07CC5F5342DE651C131629A15093D9CD;// 0x18798(0x0060)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_1C111BD945C50BA3852CAB82E22FB48D;// 0x187F8(0x0050)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_7B46D953438511CAA76ECC82EBE7F8B3;// 0x18848(0x0050)
	struct FBendAnimNode_ResetGraphBelow               BendAnimGraphNode_ResetGraphBelow_840DA98A40A1712F6A8D3E93975F0493;// 0x18898(0x0050)
	float                                              Default_Locomotion_Speed_For_Walk;                        // 0x188E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	float                                              Default_Locomotion_Speed_For_Jog;                         // 0x188EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	float                                              Default_Locomotion_Speed_For_Run;                         // 0x188F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData24[0x4];                                       // 0x188F4(0x0004) MISSED OFFSET
	class AWolfController_C*                           Wolf_Controller;                                          // 0x188F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               Wait_for_External_Condition;                              // 0x18900(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               Initialized;                                              // 0x18901(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData25[0x2];                                       // 0x18902(0x0002) MISSED OFFSET
	float                                              AttackStanceTurnAngle;                                    // 0x18904(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Was_playing_Perform_Action_In_Full_Body;                  // 0x18908(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	bool                                               Playing_Perform_Action_In_Full_Body;                      // 0x18909(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData26[0x2];                                       // 0x1890A(0x0002) MISSED OFFSET
	float                                              MinAngleForIdleTurn;                                      // 0x1890C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass WolfVim.WolfVim_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfVim_AnimGraphNode_BlendListByBool_5D5BF4A1481554FB31A7AB990425EF6B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfVim_AnimGraphNode_TransitionResult_E1F2ED5F46244DE30E6C5DB5C8948FFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfVim_AnimGraphNode_TransitionResult_A114E0CF45F52F82B9097BB65C597F6C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfVim_AnimGraphNode_TransitionResult_12FD85EF4436406827007CA761320A42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfVim_AnimGraphNode_TransitionResult_B68C3FE54737F495392A23A4336370B5();
